Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D29.atdf
        <module name="SFRBU" id="44053" version="B">
          <instance name="SFRBU">
            <register-group address-space="base" name="SFRBU" name-in-module="SFRBU" offset="0xFC05C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="77"/>
            </parameters>
          </instance>
        </module>
        <module name="SHA" id="6156" version="O">
          <instance name="SHA">
            <register-group address-space="base" name="SHA" name-in-module="SHA" offset="0xF0028000"/>
            <parameters>
              <param name="INSTANCE_ID" value="12"/>
              <param name="CLOCK_ID" value="12"/>
              <param name="DMAC_ID_TX" value="30"/>
            </parameters>
          </instance>
        </module>
        <module name="SHDWC" id="6122" version="S">
          <instance name="SHDWC">
            <register-group address-space="base" name="SHDWC" name-in-module="SHDWC" offset="0xF8048010"/>
          </instance>
        </module>
        <module name="SMC" id="11036" version="T">
          <instance name="HSMC">
            <register-group address-space="base" name="HSMC" name-in-module="SMC" offset="0xF8014000"/>
            <parameters>
              <param name="INSTANCE_ID" value="17"/>
              <param name="CLOCK_ID" value="17"/>
            </parameters>
            <signals>
              <signal pad="PC5" function="B" group="NCS" index="0"/>
              <signal pad="PD4" function="F" group="NCS" index="0"/>
              <signal pad="PD5" function="F" group="NCS" index="1"/>
              <signal pad="PC7" function="B" group="NCS" index="2"/>
              <signal pad="PD6" function="F" group="NCS" index="2"/>
              <signal pad="PA9" function="F" group="NCS" index="3"/>
              <signal pad="PA31" function="B" group="NCS" index="3"/>
              <signal pad="PA12" function="F" group="NANDOE"/>
              <signal pad="PB2" function="B" group="NANDOE"/>
              <signal pad="PA8" function="F" group="NANDNWE"/>
              <signal pad="PA30" function="B" group="NANDNWE"/>
              <signal pad="PB11" function="B" group="A0"/>
              <signal pad="PC11" function="F" group="A0"/>
              <signal pad="PC4" function="B" group="NWR1"/>
              <signal pad="PD7" function="F" group="NWR1"/>
              <signal pad="PB12" function="B" group="A" index="1"/>
              <signal pad="PB13" function="B" group="A" index="2"/>
              <signal pad="PB14" function="B" group="A" index="3"/>
              <signal pad="PB15" function="B" group="A" index="4"/>
              <signal pad="PB16" function="B" group="A" index="5"/>
              <signal pad="PB17" function="B" group="A" index="6"/>
              <signal pad="PB18" function="B" group="A" index="7"/>
              <signal pad="PB19" function="B" group="A" index="8"/>
              <signal pad="PB20" function="B" group="A" index="9"/>
              <signal pad="PB21" function="B" group="A" index="10"/>
              <signal pad="PB22" function="B" group="A" index="11"/>
              <signal pad="PB23" function="B" group="A" index="12"/>
              <signal pad="PB24" function="B" group="A" index="13"/>
              <signal pad="PB25" function="B" group="A" index="14"/>
              <signal pad="PB26" function="B" group="A" index="15"/>
              <signal pad="PB27" function="B" group="A" index="16"/>
              <signal pad="PB28" function="B" group="A" index="17"/>
              <signal pad="PB29" function="B" group="A" index="18"/>
              <signal pad="PB30" function="B" group="A" index="19"/>
              <signal pad="PB31" function="B" group="A" index="20"/>
              <signal pad="PC0" function="B" group="A" index="23"/>
              <signal pad="PC1" function="B" group="A" index="24"/>
              <signal pad="PC2" function="B" group="A" index="25"/>
              <signal pad="PC12" function="C" group="A" index="1"/>
              <signal pad="PC13" function="C" group="A" index="2"/>
              <signal pad="PC14" function="C" group="A" index="3"/>
              <signal pad="PC15" function="C" group="A" index="4"/>
              <signal pad="PC16" function="C" group="A" index="5"/>
              <signal pad="PC17" function="C" group="A" index="6"/>
              <signal pad="PC18" function="C" group="A" index="7"/>
              <signal pad="PC19" function="C" group="A" index="8"/>
              <signal pad="PC20" function="C" group="A" index="9"/>
              <signal pad="PC21" function="C" group="A" index="10"/>
              <signal pad="PC22" function="C" group="A" index="11"/>
              <signal pad="PC23" function="C" group="A" index="12"/>
              <signal pad="PC24" function="C" group="A" index="13"/>
              <signal pad="PC25" function="C" group="A" index="14"/>
              <signal pad="PC26" function="C" group="A" index="15"/>
              <signal pad="PC27" function="C" group="A" index="16"/>
              <signal pad="PC28" function="C" group="A" index="17"/>
              <signal pad="PC29" function="C" group="A" index="18"/>
              <signal pad="PC30" function="C" group="A" index="19"/>
              <signal pad="PC31" function="C" group="A" index="20"/>
              <signal pad="PD0" function="C" group="A" index="23"/>
              <signal pad="PD1" function="C" group="A" index="24"/>
              <signal pad="PD2" function="C" group="A" index="25"/>
              <signal pad="PA0" function="F" group="D" index="0"/>
              <signal pad="PA1" function="F" group="D" index="1"/>
              <signal pad="PA2" function="F" group="D" index="2"/>
              <signal pad="PA3" function="F" group="D" index="3"/>
              <signal pad="PA4" function="F" group="D" index="4"/>
              <signal pad="PA5" function="F" group="D" index="5"/>
              <signal pad="PA6" function="F" group="D" index="6"/>
              <signal pad="PA7" function="F" group="D" index="7"/>
              <signal pad="PA13" function="F" group="D" index="8"/>
              <signal pad="PA14" function="F" group="D" index="9"/>
              <signal pad="PA15" function="F" group="D" index="10"/>
              <signal pad="PA16" function="F" group="D" index="11"/>
              <signal pad="PA17" function="F" group="D" index="12"/>
              <signal pad="PA18" function="F" group="D" index="13"/>
              <signal pad="PA19" function="F" group="D" index="14"/>
              <signal pad="PA20" function="F" group="D" index="15"/>
              <signal pad="PA22" function="B" group="D" index="0"/>
              <signal pad="PA23" function="B" group="D" index="1"/>
              <signal pad="PA24" function="B" group="D" index="2"/>
              <signal pad="PA25" function="B" group="D" index="3"/>
              <signal pad="PA26" function="B" group="D" index="4"/>
              <signal pad="PA27" function="B" group="D" index="5"/>
              <signal pad="PA28" function="B" group="D" index="6"/>
              <signal pad="PA29" function="B" group="D" index="7"/>
              <signal pad="PB3" function="B" group="D" index="8"/>
              <signal pad="PB4" function="B" group="D" index="9"/>
              <signal pad="PB5" function="B" group="D" index="10"/>
              <signal pad="PB6" function="B" group="D" index="11"/>
              <signal pad="PB7" function="B" group="D" index="12"/>
              <signal pad="PB8" function="B" group="D" index="13"/>
              <signal pad="PB9" function="B" group="D" index="14"/>
              <signal pad="PB10" function="B" group="D" index="15"/>
              <signal pad="PC3" function="B" group="NWAIT"/>
              <signal pad="PD3" function="F" group="NWAIT"/>
              <signal pad="PA21" function="F" group="NANDRDY"/>
              <signal pad="PC8" function="B" group="NANDRDY"/>
              <signal pad="PD8" function="F" group="NANDRDY"/>
              <signal pad="PA10" function="F" group="A21"/>
              <signal pad="PB0" function="B" group="A21"/>
              <signal pad="PA11" function="F" group="A22"/>
              <signal pad="PB1" function="B" group="A22"/>
            </signals>
          </instance>
        </module>
        <module name="SPI" id="6088" version="ZR">
          <instance name="SPI0">
            <register-group address-space="base" name="SPI0" name-in-module="SPI" offset="0xF8000000"/>
            <parameters>
              <param name="INSTANCE_ID" value="33"/>
              <param name="CLOCK_ID" value="33"/>
              <param name="DMAC_ID_TX" value="6"/>
              <param name="DMAC_ID_RX" value="7"/>
            </parameters>
            <signals>
              <signal pad="PA16" function="A" group="SPI0_MISO"/>
              <signal pad="PA31" function="C" group="SPI0_MISO"/>
              <signal pad="PA15" function="A" group="SPI0_MOSI"/>
              <signal pad="PB0" function="C" group="SPI0_MOSI"/>
              <signal pad="PA17" function="A" group="SPI0_NPCS" index="0"/>
              <signal pad="PA30" function="C" group="SPI0_NPCS" index="0"/>
              <signal pad="PA18" function="A" group="SPI0_NPCS" index="1"/>
              <signal pad="PA29" function="C" group="SPI0_NPCS" index="1"/>
              <signal pad="PA19" function="A" group="SPI0_NPCS" index="2"/>
              <signal pad="PA27" function="C" group="SPI0_NPCS" index="2"/>
              <signal pad="PA20" function="A" group="SPI0_NPCS" index="3"/>
              <signal pad="PA28" function="C" group="SPI0_NPCS" index="3"/>
              <signal pad="PA14" function="A" group="SPI0_SPCK"/>
              <signal pad="PB1" function="C" group="SPI0_SPCK"/>
            </signals>
          </instance>
          <instance name="SPI1">
            <register-group address-space="base" name="SPI1" name-in-module="SPI" offset="0xFC000000"/>
            <parameters>
              <param name="INSTANCE_ID" value="34"/>
              <param name="CLOCK_ID" value="34"/>
              <param name="DMAC_ID_TX" value="8"/>
              <param name="DMAC_ID_RX" value="9"/>
            </parameters>
            <signals>
              <signal pad="PA24" function="D" group="SPI1_MISO"/>
              <signal pad="PC3" function="D" group="SPI1_MISO"/>
              <signal pad="PD27" function="A" group="SPI1_MISO"/>
              <signal pad="PA23" function="D" group="SPI1_MOSI"/>
              <signal pad="PC2" function="D" group="SPI1_MOSI"/>
              <signal pad="PD26" function="A" group="SPI1_MOSI"/>
              <signal pad="PA25" function="D" group="SPI1_NPCS" index="0"/>
              <signal pad="PC4" function="D" group="SPI1_NPCS" index="0"/>
              <signal pad="PD28" function="A" group="SPI1_NPCS" index="0"/>
              <signal pad="PA26" function="D" group="SPI1_NPCS" index="1"/>
              <signal pad="PC5" function="D" group="SPI1_NPCS" index="1"/>
              <signal pad="PD29" function="A" group="SPI1_NPCS" index="1"/>
              <signal pad="PA27" function="D" group="SPI1_NPCS" index="2"/>
              <signal pad="PC6" function="D" group="SPI1_NPCS" index="2"/>
              <signal pad="PD30" function="A" group="SPI1_NPCS" index="2"/>
              <signal pad="PA28" function="D" group="SPI1_NPCS" index="3"/>
              <signal pad="PC7" function="D" group="SPI1_NPCS" index="3"/>
              <signal pad="PA22" function="D" group="SPI1_SPCK"/>
              <signal pad="PC1" function="D" group="SPI1_SPCK"/>
              <signal pad="PD25" function="A" group="SPI1_SPCK"/>
            </signals>
          </instance>
        </module>
        <module name="SSC" id="6078" version="R">
          <instance name="SSC0">
            <register-group address-space="base" name="SSC0" name-in-module="SSC" offset="0xF8004000"/>
            <parameters>
              <param name="INSTANCE_ID" value="43"/>
              <param name="CLOCK_ID" value="43"/>
              <param name="DMAC_ID_TX" value="21"/>
              <param name="DMAC_ID_RX" value="22"/>
            </parameters>
            <signals>
              <signal pad="PB23" function="C" group="RD" index="0"/>
              <signal pad="PC15" function="E" group="RD" index="0"/>
              <signal pad="PB25" function="C" group="RF" index="0"/>
              <signal pad="PC17" function="E" group="RF" index="0"/>
              <signal pad="PB24" function="C" group="RK" index="0"/>
              <signal pad="PC16" function="E" group="RK" index="0"/>
              <signal pad="PB22" function="C" group="TD" index="0"/>
              <signal pad="PC14" function="E" group="TD" index="0"/>
              <signal pad="PB21" function="C" group="TF" index="0"/>
              <signal pad="PC13" function="E" group="TF" index="0"/>
              <signal pad="PB20" function="C" group="TK" index="0"/>
              <signal pad="PC12" function="E" group="TK" index="0"/>
            </signals>
          </instance>
          <instance name="SSC1">
            <register-group address-space="base" name="SSC1" name-in-module="SSC" offset="0xFC004000"/>
            <parameters>
              <param name="INSTANCE_ID" value="44"/>
              <param name="CLOCK_ID" value="44"/>
              <param name="DMAC_ID_TX" value="23"/>
              <param name="DMAC_ID_RX" value="24"/>
            </parameters>
            <signals>
              <signal pad="PA17" function="B" group="RD" index="1"/>
              <signal pad="PB17" function="C" group="RD" index="1"/>
              <signal pad="PA19" function="B" group="RF" index="1"/>
              <signal pad="PB19" function="C" group="RF" index="1"/>
              <signal pad="PA18" function="B" group="RK" index="1"/>
              <signal pad="PB18" function="C" group="RK" index="1"/>
              <signal pad="PA16" function="B" group="TD" index="1"/>
              <signal pad="PB16" function="C" group="TD" index="1"/>
              <signal pad="PA15" function="B" group="TF" index="1"/>
              <signal pad="PB15" function="C" group="TF" index="1"/>
              <signal pad="PA14" function="B" group="TK" index="1"/>
              <signal pad="PB14" function="C" group="TK" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="TC" id="6082" version="ZO">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0xF800C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="35"/>
              <param name="CLOCK_ID" value="35"/>
              <param name="DMAC_ID_RX" value="45"/>
              <param name="TCCLKS_" value="0" caption="MCK"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="GCLK"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="SLCK"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="1"/>
              <param name="TIMER_WIDTH" value="32"/>
            </parameters>
            <signals>
              <signal pad="PA21" function="D" group="TCLK" index="0"/>
              <signal pad="PA29" function="A" group="TCLK" index="1"/>
              <signal pad="PC5" function="C" group="TCLK" index="1"/>
              <signal pad="PD13" function="A" group="TCLK" index="1"/>
              <signal pad="PB5" function="A" group="TCLK" index="2"/>
              <signal pad="PB24" function="D" group="TCLK" index="2"/>
              <signal pad="PD22" function="A" group="TCLK" index="2"/>
              <signal pad="PA19" function="D" group="TIOA" index="0"/>
              <signal pad="PA27" function="A" group="TIOA" index="1"/>
              <signal pad="PC3" function="C" group="TIOA" index="1"/>
              <signal pad="PD11" function="A" group="TIOA" index="1"/>
              <signal pad="PB6" function="A" group="TIOA" index="2"/>
              <signal pad="PB22" function="D" group="TIOA" index="2"/>
              <signal pad="PD20" function="A" group="TIOA" index="2"/>
              <signal pad="PA20" function="D" group="TIOB" index="0"/>
              <signal pad="PA28" function="A" group="TIOB" index="1"/>
              <signal pad="PC4" function="C" group="TIOB" index="1"/>
              <signal pad="PD12" function="A" group="TIOB" index="1"/>
              <signal pad="PB7" function="A" group="TIOB" index="2"/>
              <signal pad="PB23" function="D" group="TIOB" index="2"/>
              <signal pad="PD21" function="A" group="TIOB" index="2"/>
            </signals>
          </instance>
          <instance name="TC1">
            <register-group address-space="base" name="TC1" name-in-module="TC" offset="0xF8010000"/>
            <parameters>
              <param name="INSTANCE_ID" value="36"/>
              <param name="CLOCK_ID" value="36"/>
              <param name="DMAC_ID_RX" value="46"/>
              <param name="TCCLKS_" value="0" caption="MCK"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="GCLK"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="SLCK"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="1"/>
              <param name="TIMER_WIDTH" value="32"/>
            </parameters>
            <signals>
              <signal pad="PB8" function="A" group="TCLK" index="3"/>
              <signal pad="PB21" function="D" group="TCLK" index="3"/>
              <signal pad="PD31" function="D" group="TCLK" index="3"/>
              <signal pad="PA11" function="D" group="TCLK" index="4"/>
              <signal pad="PC11" function="D" group="TCLK" index="4"/>
              <signal pad="PA8" function="D" group="TCLK" index="5"/>
              <signal pad="PB30" function="D" group="TCLK" index="5"/>
              <signal pad="PB9" function="A" group="TIOA" index="3"/>
              <signal pad="PB19" function="D" group="TIOA" index="3"/>
              <signal pad="PD29" function="D" group="TIOA" index="3"/>
              <signal pad="PA9" function="D" group="TIOA" index="4"/>
              <signal pad="PC9" function="D" group="TIOA" index="4"/>
              <signal pad="PA6" function="D" group="TIOA" index="5"/>
              <signal pad="PB28" function="D" group="TIOA" index="5"/>
              <signal pad="PB10" function="A" group="TIOB" index="3"/>
              <signal pad="PB20" function="D" group="TIOB" index="3"/>
              <signal pad="PD30" function="D" group="TIOB" index="3"/>
              <signal pad="PA10" function="D" group="TIOB" index="4"/>
              <signal pad="PC10" function="D" group="TIOB" index="4"/>
              <signal pad="PA7" function="D" group="TIOB" index="5"/>
              <signal pad="PB29" function="D" group="TIOB" index="5"/>
            </signals>
          </instance>
        </module>
        <module name="TDES" id="6150" version="N">
          <instance name="TDES">
            <register-group address-space="base" name="TDES" name-in-module="TDES" offset="0xFC044000"/>
            <parameters>
              <param name="INSTANCE_ID" value="11"/>
              <param name="CLOCK_ID" value="11"/>
              <param name="DMAC_ID_TX" value="28"/>
              <param name="DMAC_ID_RX" value="29"/>
            </parameters>
          </instance>
        </module>
        <module name="TRNG" id="6334" version="K">
          <instance name="TRNG">
            <register-group address-space="base" name="TRNG" name-in-module="TRNG" offset="0xFC01C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="47"/>
              <param name="CLOCK_ID" value="47"/>
            </parameters>
          </instance>
        </module>
        <module name="TWIHS" id="11210" version="ZB">
          <instance name="TWIHS0">
            <register-group address-space="base" name="TWIHS0" name-in-module="TWIHS" offset="0xF8028000"/>
            <parameters>
              <param name="INSTANCE_ID" value="29"/>
              <param name="CLOCK_ID" value="29"/>
              <param name="DMAC_ID_TX" value="0"/>
              <param name="DMAC_ID_RX" value="1"/>
            </parameters>
            <signals>
              <signal pad="PC0" function="D" group="TWCK" index="0"/>
              <signal pad="PC28" function="E" group="TWCK" index="0"/>
              <signal pad="PD22" function="B" group="TWCK" index="0"/>
              <signal pad="PD30" function="E" group="TWCK" index="0"/>
              <signal pad="PB31" function="D" group="TWD" index="0"/>
              <signal pad="PC27" function="E" group="TWD" index="0"/>
              <signal pad="PD21" function="B" group="TWD" index="0"/>
              <signal pad="PD29" function="E" group="TWD" index="0"/>
            </signals>
          </instance>
          <instance name="TWIHS1">
            <register-group address-space="base" name="TWIHS1" name-in-module="TWIHS" offset="0xFC028000"/>
            <parameters>
              <param name="INSTANCE_ID" value="30"/>
              <param name="CLOCK_ID" value="30"/>
              <param name="DMAC_ID_TX" value="2"/>
              <param name="DMAC_ID_RX" value="3"/>
            </parameters>
            <signals>
              <signal pad="PC7" function="C" group="TWCK" index="1"/>
              <signal pad="PD5" function="A" group="TWCK" index="1"/>
              <signal pad="PD20" function="B" group="TWCK" index="1"/>
              <signal pad="PC6" function="C" group="TWD" index="1"/>
              <signal pad="PD4" function="A" group="TWD" index="1"/>
              <signal pad="PD19" function="B" group="TWD" index="1"/>
            </signals>
          </instance>
        </module>
