Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D29.atdf
      <value-group caption="Invert Comparator Output" name="ACC_MR__INV">
        <value caption="Analog comparator output is directly processed." name="DIS" value="0"/>
        <value caption="Analog comparator output is inverted prior to being processed." name="EN" value="1"/>
      </value-group>
      <value-group caption="Write Protection Key" name="ACC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x414343"/>
      </value-group>
    </module>
    <module caption="Analog-to-Digital Converter" id="44073" name="ADC" version="G">
      <register-group name="ADC">
        <register caption="Control Register" name="ADC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
          <bitfield caption="Touchscreen Calibration" mask="0x00000004" name="TSCALIB"/>
          <bitfield caption="Comparison Restart" mask="0x00000010" name="CMPRST"/>
        </register>
        <register caption="Mode Register" name="ADC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL" values="ADC_MR__TRGSEL"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP" values="ADC_MR__SLEEP"/>
          <bitfield caption="Fast Wakeup" mask="0x00000040" name="FWUP" values="ADC_MR__FWUP"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
          <bitfield caption="Startup Time" mask="0x000F0000" name="STARTUP" values="ADC_MR__STARTUP"/>
          <bitfield caption="Analog Change" mask="0x00800000" name="ANACH" values="ADC_MR__ANACH"/>
          <bitfield caption="Tracking Time" mask="0x0F000000" name="TRACKTIM"/>
          <bitfield caption="Transfer Time" mask="0x30000000" name="TRANSFER"/>
          <bitfield caption="Maximum Sampling Rate Enable in Freerun Mode" mask="0x40000000" name="MAXSPEED"/>
          <bitfield caption="Use Sequence Enable" mask="0x80000000" name="USEQ" values="ADC_MR__USEQ"/>
        </register>
        <register caption="Channel Sequence Register 1" name="ADC_SEQR1" offset="0x08" rw="RW" size="4">
          <bitfield caption="User Sequence Number 1" mask="0x0000000F" name="USCH1"/>
          <bitfield caption="User Sequence Number 2" mask="0x000000F0" name="USCH2"/>
          <bitfield caption="User Sequence Number 3" mask="0x00000F00" name="USCH3"/>
          <bitfield caption="User Sequence Number 4" mask="0x0000F000" name="USCH4"/>
          <bitfield caption="User Sequence Number 5" mask="0x000F0000" name="USCH5"/>
          <bitfield caption="User Sequence Number 6" mask="0x00F00000" name="USCH6"/>
          <bitfield caption="User Sequence Number 7" mask="0x0F000000" name="USCH7"/>
          <bitfield caption="User Sequence Number 8" mask="0xF0000000" name="USCH8"/>
        </register>
        <register caption="Channel Sequence Register 2" name="ADC_SEQR2" offset="0x0C" rw="RW" size="4">
          <bitfield caption="User Sequence Number 9" mask="0x0000000F" name="USCH9"/>
          <bitfield caption="User Sequence Number 10" mask="0x000000F0" name="USCH10"/>
          <bitfield caption="User Sequence Number 11" mask="0x00000F00" name="USCH11"/>
        </register>
        <register caption="Channel Enable Register" name="ADC_CHER" offset="0x10" rw="W" size="4" atomic-op="set:ADC_CHSR">
          <bitfield caption="Channel 0 Enable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Enable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Enable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Enable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Enable" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Enable" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Enable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Enable" mask="0x00000080" name="CH7"/>
          <bitfield caption="Channel 8 Enable" mask="0x00000100" name="CH8"/>
          <bitfield caption="Channel 9 Enable" mask="0x00000200" name="CH9"/>
          <bitfield caption="Channel 10 Enable" mask="0x00000400" name="CH10"/>
          <bitfield caption="Channel 11 Enable" mask="0x00000800" name="CH11"/>
        </register>
        <register caption="Channel Disable Register" name="ADC_CHDR" offset="0x14" rw="W" size="4" atomic-op="clear:ADC_CHSR">
          <bitfield caption="Channel 0 Disable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Disable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Disable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Disable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Disable" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Disable" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Disable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Disable" mask="0x00000080" name="CH7"/>
          <bitfield caption="Channel 8 Disable" mask="0x00000100" name="CH8"/>
          <bitfield caption="Channel 9 Disable" mask="0x00000200" name="CH9"/>
          <bitfield caption="Channel 10 Disable" mask="0x00000400" name="CH10"/>
          <bitfield caption="Channel 11 Disable" mask="0x00000800" name="CH11"/>
        </register>
        <register caption="Channel Status Register" name="ADC_CHSR" offset="0x18" rw="R" size="4" atomic-op="clear:ADC_CHSR">
          <bitfield caption="Channel 0 Status" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Status" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Status" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Status" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Status" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Status" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Status" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Status" mask="0x00000080" name="CH7"/>
          <bitfield caption="Channel 8 Status" mask="0x00000100" name="CH8"/>
          <bitfield caption="Channel 9 Status" mask="0x00000200" name="CH9"/>
          <bitfield caption="Channel 10 Status" mask="0x00000400" name="CH10"/>
          <bitfield caption="Channel 11 Status" mask="0x00000800" name="CH11"/>
        </register>
        <register caption="Last Converted Data Register" name="ADC_LCDR" offset="0x20" rw="R" size="4">
          <bitfield caption="Last Data Converted" mask="0x0000FFFF" name="LDATA"/>
          <bitfield caption="Channel Number in Oversampling Mode" mask="0x1F000000" name="CHNBOSR"/>
        </register>
        <register caption="Interrupt Enable Register" name="ADC_IER" offset="0x24" rw="W" size="4" atomic-op="set:ADC_IMR">
          <bitfield caption="End of Conversion Interrupt Enable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Enable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Enable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Enable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Enable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Enable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Enable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Enable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion Interrupt Enable 8" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion Interrupt Enable 9" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Conversion Interrupt Enable 10" mask="0x00000400" name="EOC10"/>
          <bitfield caption="End of Conversion Interrupt Enable 11" mask="0x00000800" name="EOC11"/>
          <bitfield caption="Last Channel Change Interrupt Enable" mask="0x00080000" name="LCCHG"/>
          <bitfield caption="Touchscreen Measure XPOS Ready Interrupt Enable" mask="0x00100000" name="XRDY"/>
          <bitfield caption="Touchscreen Measure YPOS Ready Interrupt Enable" mask="0x00200000" name="YRDY"/>
          <bitfield caption="Touchscreen Measure Pressure Ready Interrupt Enable" mask="0x00400000" name="PRDY"/>
          <bitfield caption="Data Ready Interrupt Enable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Enable" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Enable" mask="0x04000000" name="COMPE"/>
          <bitfield caption="Pen Contact Interrupt Enable" mask="0x20000000" name="PEN"/>
          <bitfield caption="No Pen Contact Interrupt Enable" mask="0x40000000" name="NOPEN"/>
        </register>
        <register caption="Interrupt Disable Register" name="ADC_IDR" offset="0x28" rw="W" size="4" atomic-op="clear:ADC_IMR">
          <bitfield caption="End of Conversion Interrupt Disable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Disable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Disable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Disable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Disable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Disable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Disable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Disable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion Interrupt Disable 8" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion Interrupt Disable 9" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Conversion Interrupt Disable 10" mask="0x00000400" name="EOC10"/>
          <bitfield caption="End of Conversion Interrupt Disable 11" mask="0x00000800" name="EOC11"/>
          <bitfield caption="Last Channel Change Interrupt Disable" mask="0x00080000" name="LCCHG"/>
          <bitfield caption="Touchscreen Measure XPOS Ready Interrupt Disable" mask="0x00100000" name="XRDY"/>
          <bitfield caption="Touchscreen Measure YPOS Ready Interrupt Disable" mask="0x00200000" name="YRDY"/>
          <bitfield caption="Touchscreen Measure Pressure Ready Interrupt Disable" mask="0x00400000" name="PRDY"/>
          <bitfield caption="Data Ready Interrupt Disable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Disable" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Disable" mask="0x04000000" name="COMPE"/>
          <bitfield caption="Pen Contact Interrupt Disable" mask="0x20000000" name="PEN"/>
          <bitfield caption="No Pen Contact Interrupt Disable" mask="0x40000000" name="NOPEN"/>
        </register>
        <register caption="Interrupt Mask Register" name="ADC_IMR" offset="0x2C" rw="R" size="4" atomic-op="read:ADC_IMR">
          <bitfield caption="End of Conversion Interrupt Mask 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Mask 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Mask 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Mask 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Mask 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Mask 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Mask 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Mask 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion Interrupt Mask 8" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion Interrupt Mask 9" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Conversion Interrupt Mask 10" mask="0x00000400" name="EOC10"/>
          <bitfield caption="End of Conversion Interrupt Mask 11" mask="0x00000800" name="EOC11"/>
          <bitfield caption="Last Channel Change Interrupt Disable" mask="0x00080000" name="LCCHG"/>
          <bitfield caption="Touchscreen Measure XPOS Ready Interrupt Mask" mask="0x00100000" name="XRDY"/>
          <bitfield caption="Touchscreen Measure YPOS Ready Interrupt Mask" mask="0x00200000" name="YRDY"/>
          <bitfield caption="Touchscreen Measure Pressure Ready Interrupt Mask" mask="0x00400000" name="PRDY"/>
          <bitfield caption="Data Ready Interrupt Mask" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Mask" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Mask" mask="0x04000000" name="COMPE"/>
          <bitfield caption="Pen Contact Interrupt Mask" mask="0x20000000" name="PEN"/>
          <bitfield caption="No Pen Contact Interrupt Mask" mask="0x40000000" name="NOPEN"/>
        </register>
        <register caption="Interrupt Status Register" name="ADC_ISR" offset="0x30" rw="R" size="4" atomic-op="clear:ADC_ISR">
          <bitfield caption="End of Conversion 0 (automatically set / cleared)" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion 1 (automatically set / cleared)" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion 2 (automatically set / cleared)" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion 3 (automatically set / cleared)" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion 4 (automatically set / cleared)" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion 5 (automatically set / cleared)" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion 6 (automatically set / cleared)" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion 7 (automatically set / cleared)" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion 8 (automatically set / cleared)" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion 9 (automatically set / cleared)" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Conversion 10 (automatically set / cleared)" mask="0x00000400" name="EOC10"/>
          <bitfield caption="End of Conversion 11 (automatically set / cleared)" mask="0x00000800" name="EOC11"/>
          <bitfield caption="Last Channel Change (cleared on read)" mask="0x00080000" name="LCCHG"/>
          <bitfield caption="Touchscreen XPOS Measure Ready (cleared on read)" mask="0x00100000" name="XRDY"/>
          <bitfield caption="Touchscreen YPOS Measure Ready (cleared on read)" mask="0x00200000" name="YRDY"/>
          <bitfield caption="Touchscreen Pressure Measure Ready (cleared on read)" mask="0x00400000" name="PRDY"/>
          <bitfield caption="Data Ready (automatically set / cleared)" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error (cleared on read)" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event (cleared on read)" mask="0x04000000" name="COMPE"/>
          <bitfield caption="Pen contact (cleared on read)" mask="0x20000000" name="PEN"/>
          <bitfield caption="No Pen Contact (cleared on read)" mask="0x40000000" name="NOPEN"/>
          <bitfield caption="Pen Detect Status" mask="0x80000000" name="PENS"/>
        </register>
        <register caption="Last Channel Trigger Mode Register" name="ADC_LCTMR" offset="0x34" rw="RW" size="4">
          <bitfield caption="Dual Trigger ON" mask="0x00000001" name="DUALTRIG"/>
          <bitfield caption="Last Channel Comparison Mode" mask="0x00000030" name="CMPMOD" values="ADC_LCTMR__CMPMOD"/>
        </register>
