Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D29.atdf
      <value-group caption="Bit Rate Source Clock" name="FLEX_SPI_MR__BRSRCCLK">
        <value caption="The peripheral clock is the source clock for the bit rate generation." name="PERIPH_CLK" value="0"/>
        <value caption="GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock." name="GCLK" value="1"/>
      </value-group>
      <value-group caption="Comparison Mode" name="FLEX_SPI_MR__CMPMODE">
        <value caption="Any character is received and comparison function drives CMP flag." name="FLAG_ONLY" value="0"/>
        <value caption="Comparison condition must be met to start reception of all incoming characters until REQCLR is set." name="START_CONDITION" value="1"/>
      </value-group>
      <value-group caption="Bits Per Transfer" name="FLEX_SPI_CSR__BITS">
        <value caption="8 bits for transfer" name="8_BIT" value="0x0"/>
        <value caption="9 bits for transfer" name="9_BIT" value="0x1"/>
        <value caption="10 bits for transfer" name="10_BIT" value="0x2"/>
        <value caption="11 bits for transfer" name="11_BIT" value="0x3"/>
        <value caption="12 bits for transfer" name="12_BIT" value="0x4"/>
        <value caption="13 bits for transfer" name="13_BIT" value="0x5"/>
        <value caption="14 bits for transfer" name="14_BIT" value="0x6"/>
        <value caption="15 bits for transfer" name="15_BIT" value="0x7"/>
        <value caption="16 bits for transfer" name="16_BIT" value="0x8"/>
      </value-group>
      <value-group caption="Transmit Data Register Empty Mode" name="FLEX_SPI_FMR__TXRDYM">
        <value caption="TDRE will be at level '1' when at least one data can be written in the Transmit FIFO." name="ONE_DATA" value="0"/>
        <value caption="TDRE will be at level '1' when at least two data can be written in the Transmit FIFO.Cannot be used if FLEX_SPI_MR.PS =1." name="TWO_DATA" value="1"/>
      </value-group>
      <value-group caption="Receive Data Register Full Mode" name="FLEX_SPI_FMR__RXRDYM">
        <value caption="RDRF will be at level '1' when at least one unread data is in the Receive FIFO." name="ONE_DATA" value="0x0"/>
        <value caption="RDRF will be at level '1' when at least two unread data are in the Receive FIFO.Cannot be used if FLEX_SPI_MR.PS =1." name="TWO_DATA" value="0x1"/>
        <value caption="RDRF will be at level '1' when at least four unread data are in the Receive FIFO.Cannot be used when FLEX_SPI_CSRx.BITS is greater than 0, or if FLEX_SPI_MR.MSTR =1, or if FLEX_SPI_MR.PS =1." name="FOUR_DATA" value="0x2"/>
      </value-group>
      <value-group caption="Write Protection Key" name="FLEX_SPI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0" name="PASSWD" value="0x535049"/>
      </value-group>
      <value-group caption="Internal Device Address Size" name="FLEX_TWI_MMR__IADRSZ">
        <value caption="No internal device address" name="NONE" value="0x0"/>
        <value caption="One-byte internal device address" name="1_BYTE" value="0x1"/>
        <value caption="Two-byte internal device address" name="2_BYTE" value="0x2"/>
        <value caption="Three-byte internal device address" name="3_BYTE" value="0x3"/>
      </value-group>
      <value-group caption="Bit Rate Source Clock" name="FLEX_TWI_CWGR__BRSRCCLK">
        <value caption="The peripheral clock is the source clock for the bit rate generation." name="PERIPH_CLK" value="0"/>
        <value caption="GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock." name="GCLK" value="1"/>
      </value-group>
      <value-group caption="Transmitter Ready Mode" name="FLEX_TWI_FMR__TXRDYM">
        <value caption="TXRDY will be at level '1' when at least one data can be written in the Transmit FIFO" name="ONE_DATA" value="0x0"/>
        <value caption="TXRDY will be at level '1' when at least two data can be written in the Transmit FIFO" name="TWO_DATA" value="0x1"/>
        <value caption="TXRDY will be at level '1' when at least four data can be written in the Transmit FIFO" name="FOUR_DATA" value="0x2"/>
      </value-group>
      <value-group caption="Receiver Ready Mode" name="FLEX_TWI_FMR__RXRDYM">
        <value caption="RXRDY will be at level '1' when at least one unread data is in the Receive FIFO" name="ONE_DATA" value="0x0"/>
        <value caption="RXRDY will be at level '1' when at least two unread data are in the Receive FIFO" name="TWO_DATA" value="0x1"/>
        <value caption="RXRDY will be at level '1' when at least four unread data are in the Receive FIFO" name="FOUR_DATA" value="0x2"/>
      </value-group>
      <value-group caption="Write Protection Key" name="FLEX_TWI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0" name="PASSWD" value="0x545749"/>
      </value-group>
    </module>
    <module name="GMAC" id="44152" version="2P03" caption="Gigabit Ethernet MAC">
      <register-group name="GMAC_SA" size="8">
        <register caption="Specific Address 1 Bottom Register" name="GMAC_SAB" offset="0x00" rw="RW" size="4">
          <bitfield caption="Specific Address 1" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 1 Top Register" name="GMAC_SAT" offset="0x04" rw="RW" size="4">
          <bitfield name="ADDR" caption="Specific Address 2" mask="0xFFFF"/>
          <bitfield name="FILTSORD" caption="Filter Source or Destination MAC Address" mask="0x10000" values="GMAC_SAT__FILTSORD"/>
          <bitfield name="FILTBMASK" caption="Filter Bytes Mask" mask="0x3F000000" values="GMAC_SAT__FILTBMASK"/>
        </register>
      </register-group>
      <register-group name="GMAC_ST2CW" size="0x08">
        <register name="GMAC_ST2CW0" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Screening Type 2 Compare Word 0 Register ">
          <bitfield name="MASKVAL" caption="Mask Value" mask="0xFFFF"/>
          <bitfield name="COMPVAL" caption="Compare Value" mask="0xFFFF0000"/>
        </register>
        <register name="GMAC_ST2CW1" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Screening Type 2 Compare Word 1 Register ">
          <bitfield name="OFFSVAL" caption="Offset Value in Bytes" mask="0x7F"/>
          <bitfield name="OFFSSTRT" caption="Ethernet Frame Offset Start" mask="0x180" values="GMAC_ST2CW1R__OFFSSTRT"/>
          <bitfield name="DISMASK" caption="Disable Mask" mask="0x200" values="GMAC_ST2CW1R__DISMASK"/>
        </register>
      </register-group>
      <register-group name="GMAC" caption="Gigabit Ethernet MAC">
        <register name="GMAC_NCR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Network Control Register">
          <bitfield name="LBL" caption="Loop Back Local" mask="0x2" values="GMAC_NCR__LBL"/>
          <bitfield name="RXEN" caption="Receive Enable" mask="0x4" values="GMAC_NCR__RXEN"/>
          <bitfield name="TXEN" caption="Transmit Enable" mask="0x8" values="GMAC_NCR__TXEN"/>
          <bitfield name="MPE" caption="Management Port Enable" mask="0x10" values="GMAC_NCR__MPE"/>
          <bitfield name="CLRSTAT" caption="Clear Statistics Registers (Write-only)" mask="0x20" values="GMAC_NCR__CLRSTAT"/>
          <bitfield name="INCSTAT" caption="Increment Statistics Registers (Write-only)" mask="0x40"/>
          <bitfield name="WESTAT" caption="Write Enable for Statistics Registers" mask="0x80" values="GMAC_NCR__WESTAT"/>
          <bitfield name="BP" caption="Back Pressure" mask="0x100" values="GMAC_NCR__BP"/>
          <bitfield name="TSTART" caption="Start Transmission (Write-only)" mask="0x200" values="GMAC_NCR__TSTART"/>
          <bitfield name="THALT" caption="Transmit Halt (Write-only)" mask="0x400" values="GMAC_NCR__THALT"/>
          <bitfield name="TXPF" caption="Transmit Pause Frame (Write-only)" mask="0x800" values="GMAC_NCR__TXPF"/>
          <bitfield name="TXZQPF" caption="Transmit Zero Quantum Pause Frame (Write-only)" mask="0x1000" values="GMAC_NCR__TXZQPF"/>
          <bitfield name="SRTSM" caption="Store Receive Timestamp to Memory" mask="0x8000" values="GMAC_NCR__SRTSM"/>
          <bitfield name="ENPBPR" caption="Enable PFC Priority-based Pause Reception" mask="0x10000"/>
          <bitfield name="TXPBPF" caption="Transmit PFC Priority-based Pause Frame" mask="0x20000" values="GMAC_NCR__TXPBPF"/>
          <bitfield name="FNP" caption="Flush Next Packet" mask="0x40000" values="GMAC_NCR__FNP"/>
          <bitfield name="TXLPIEN" caption="Enable LPI Transmission" mask="0x80000"/>
          <bitfield name="PTPUNIENA" caption="Detection of Unicast PTP Frames Enable" mask="0x100000" values="GMAC_NCR__PTPUNIENA"/>
          <bitfield name="STUDPOFFSET" caption="Store UDP Offset" mask="0x400000" values="GMAC_NCR__STUDPOFFSET"/>
          <bitfield name="OSSMODE" caption="One Step Sync Mode" mask="0x1000000" values="GMAC_NCR__OSSMODE"/>
          <bitfield name="PFCCTL" caption="Multiple PFC Pause quantum Enable" mask="0x2000000" values="GMAC_NCR__PFCCTL"/>
          <bitfield name="EXTSELRQEN" caption="External Selection of Receive Queue Enable" mask="0x4000000" values="GMAC_NCR__EXTSELRQEN"/>
          <bitfield name="OSSCORR" caption="OSS Correction Field" mask="0x8000000"/>
          <bitfield name="MIIONRGMII" caption="MII Control" mask="0x10000000" values="GMAC_NCR__MIIONRGMII"/>
          <bitfield name="IFGQAVCRED" caption="Credit-Based Shaping Algorithm Modification" mask="0x40000000" values="GMAC_NCR__IFGQAVCRED"/>
        </register>
        <register name="GMAC_NCFGR" offset="0x4" rw="RW" size="4" initval="0x00080000" caption="Network Configuration Register">
          <bitfield name="SPD" caption="Speed" mask="0x1"/>
          <bitfield name="FD" caption="Full Duplex" mask="0x2"/>
          <bitfield name="DNVLAN" caption="Discard Non-VLAN FRAMES" mask="0x4"/>
          <bitfield name="JFRAME" caption="Jumbo Frame Size" mask="0x8"/>
          <bitfield name="CAF" caption="Copy All Frames" mask="0x10"/>
          <bitfield name="NBC" caption="No Broadcast" mask="0x20"/>
          <bitfield name="MTIHEN" caption="Multicast Hash Enable" mask="0x40"/>
          <bitfield name="UNIHEN" caption="Unicast Hash Enable" mask="0x80"/>
          <bitfield name="MAXFS" caption="1536 Maximum Frame Size" mask="0x100"/>
          <bitfield name="RTY" caption="Retry Test0" mask="0x1000"/>
          <bitfield name="PEN" caption="Pause Enable" mask="0x2000"/>
          <bitfield name="RXBUFO" caption="Receive Buffer Offset" mask="0xC000"/>
          <bitfield name="LFERD" caption="Length Field Error Frame Discard" mask="0x10000"/>
          <bitfield name="RFCS" caption="Remove FCS" mask="0x20000"/>
          <bitfield name="CLK" caption="MDC CLock Division" mask="0x1C0000" values="GMAC_NCFGR__CLK"/>
          <bitfield name="DBW" caption="Data Bus Width" mask="0x600000"/>
          <bitfield name="DCPF" caption="Disable Copy of Pause Frames" mask="0x800000"/>
          <bitfield name="RXCOEN" caption="Receive Checksum Offload Enable" mask="0x1000000"/>
          <bitfield name="EFRHD" caption="Enable Frames Received in Half Duplex" mask="0x2000000"/>
          <bitfield name="IRXFCS" caption="Ignore RX FCS" mask="0x4000000"/>
          <bitfield name="IPGSEN" caption="IP Stretch Enable" mask="0x10000000"/>
          <bitfield name="RXBP" caption="Receive Bad Preamble" mask="0x20000000"/>
          <bitfield name="IRXER" caption="Ignore Receive Error from PHY" mask="0x40000000"/>
        </register>
        <register name="GMAC_NSR" offset="0x8" rw="R" size="4" caption="Network Status Register">
          <bitfield name="MDIO" caption="MDIO Input Status" mask="0x2"/>
          <bitfield name="IDLE" caption="PHY Management Logic Idle" mask="0x4"/>
          <bitfield name="PFCPAUSN" caption="PFC Pause Negotiated" mask="0x40"/>
          <bitfield name="RXLPIS" caption="LPI Indication" mask="0x80"/>
        </register>
        <register name="GMAC_UR" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="User Register">
          <bitfield name="RMII" caption="Reduced MII Mode" mask="0x1" values="GMAC_UR__RMII"/>
          <bitfield name="HDFLCTLEN" caption="Half Duplex Flow Control Enable" mask="0x40" values="GMAC_UR__HDFLCTLEN"/>
        </register>
