Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D29.atdf
        <register name="GMAC_DCFGR" offset="0x10" rw="RW" size="4" initval="0x00020004" caption="DMA Configuration Register">
          <bitfield name="FBLDO" caption="Fixed Burst Length for DMA Data Operations:" mask="0x1F" values="GMAC_DCFGR__FBLDO"/>
          <bitfield name="ESMA" caption="Endian Swap Mode Enable for Management Descriptor Accesses" mask="0x40" values="GMAC_DCFGR__ESMA"/>
          <bitfield name="ESPA" caption="Endian Swap Mode Enable for Packet Data Accesses" mask="0x80" values="GMAC_DCFGR__ESPA"/>
          <bitfield name="RXBMS" caption="Receiver Packet Buffer Memory Size Select" mask="0x300" values="GMAC_DCFGR__RXBMS"/>
          <bitfield name="TXPBMS" caption="Transmitter Packet Buffer Memory Size Select" mask="0x400" values="GMAC_DCFGR__TXPBMS"/>
          <bitfield name="TXCOEN" caption="Transmitter Checksum Generation Offload Enable" mask="0x800"/>
          <bitfield name="INFLASTEN" caption="Infinite Size for Last Buffer Enable" mask="0x1000"/>
          <bitfield name="CRCERRREP" caption="CRC Errors Report" mask="0x2000" values="GMAC_DCFGR__CRCERRREP"/>
          <bitfield name="DRBS" caption="DMA Receive Buffer Size" mask="0xFF0000" values="GMAC_DCFGR__DRBS"/>
          <bitfield name="DDRP" caption="DMA Discard Receive Packets" mask="0x1000000"/>
          <bitfield name="RXFOMAXB" caption="Force Receive Max Burst Length" mask="0x2000000"/>
          <bitfield name="TXFOMAXB" caption="Force Transmit Max Burst Length" mask="0x4000000"/>
          <bitfield name="RXBD_EXTENDED" caption="Receive Buffer Descriptor Extended Mode" mask="0x10000000" values="GMAC_DCFGR__RXBD_EXTENDED"/>
          <bitfield name="TXBD_EXTENDED" caption="Transmit Buffer Descriptor Extended Mode" mask="0x20000000" values="GMAC_DCFGR__TXBD_EXTENDED"/>
        </register>
        <register name="GMAC_TSR" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Transmit Status Register">
          <bitfield name="UBR" caption="Used Bit Read" mask="0x1"/>
          <bitfield name="COL" caption="Collision Occurred" mask="0x2"/>
          <bitfield name="RLE" caption="Retry Limit Exceeded" mask="0x4"/>
          <bitfield name="TXGO" caption="Transmit Go (Read only)" mask="0x8"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to System Bus Error" mask="0x10"/>
          <bitfield name="TXCOMP" caption="Transmit Complete" mask="0x20"/>
          <bitfield name="HRESP" caption="System Bus Response" mask="0x100"/>
        </register>
        <register name="GMAC_RBQB" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Receive Buffer Queue Base Address Register">
          <bitfield name="RXQDIS" caption="Receive Queue Disable" mask="0x1" values="GMAC_RBQB__RXQDIS"/>
          <bitfield name="ADDR" caption="Receive Buffer Queue Base Address" mask="0xFFFFFFFC"/>
        </register>
        <register name="GMAC_TBQB" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="Transmit Buffer Queue Base Address Register">
          <bitfield name="TXQDIS" caption="Transmit Queue Disable" mask="0x1" values="GMAC_TBQB__TXQDIS"/>
          <bitfield name="ADDR" caption="Transmit Buffer Queue Base Address" mask="0xFFFFFFFC"/>
        </register>
        <register name="GMAC_RSR" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Receive Status Register">
          <bitfield name="BNA" caption="Buffer Not Available" mask="0x1"/>
          <bitfield name="REC" caption="Frame Received" mask="0x2"/>
          <bitfield name="RXOVR" caption="Receive Overrun" mask="0x4"/>
          <bitfield name="HNO" caption="System Bus Error" mask="0x8"/>
        </register>
        <register name="GMAC_ISR" offset="0x24" rw="R" size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="MFS" caption="Management Frame Sent (Cleared on read)" mask="0x1"/>
          <bitfield name="RCOMP" caption="Receive Complete (Cleared on read)" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read (Cleared on read)" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read (Cleared on read)" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun (Cleared on read)" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded(Cleared on read)" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to System Bus Error (Cleared on read)" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete (Cleared on read)" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun (Cleared on read)" mask="0x400"/>
          <bitfield name="HRESP" caption="System Bus Error (Cleared on read)" mask="0x800"/>
          <bitfield name="PFNZ" caption="Pause Frame with Non-zero Pause Quantum Received (Cleared on read)" mask="0x1000"/>
          <bitfield name="PTZ" caption="Pause Time Zero (Cleared on read)" mask="0x2000"/>
          <bitfield name="PFTR" caption="Pause Frame Transmitted (Cleared on read)" mask="0x4000"/>
          <bitfield name="DRQFR" caption="PTP Delay Request Frame Received (Cleared on read)" mask="0x40000"/>
          <bitfield name="SFR" caption="PTP Sync Frame Received (Cleared on read)" mask="0x80000"/>
          <bitfield name="DRQFT" caption="PTP Delay Request Frame Transmitted (Cleared on read)" mask="0x100000"/>
          <bitfield name="SFT" caption="PTP Sync Frame Transmitted (Cleared on read)" mask="0x200000"/>
          <bitfield name="PDRQFR" caption="PDelay Request Frame Received (Cleared on read)" mask="0x400000"/>
          <bitfield name="PDRSFR" caption="PDelay Response Frame Received (Cleared on read)" mask="0x800000"/>
          <bitfield name="PDRQFT" caption="PDelay Request Frame Transmitted (Cleared on read)" mask="0x1000000"/>
          <bitfield name="PDRSFT" caption="PDelay Response Frame Transmitted (Cleared on read)" mask="0x2000000"/>
          <bitfield name="SRI" caption="TSU Seconds Register Increment (Cleared on read)" mask="0x4000000"/>
          <bitfield name="RXLPISBC" caption="Receive LPI indication Status Bit Change (Cleared on read)" mask="0x8000000"/>
          <bitfield name="WOL" caption="Wake On LAN" mask="0x10000000"/>
          <bitfield name="TSUTIMCOMP" caption="TSU Timer Comparison (Cleared on read)" mask="0x20000000"/>
        </register>
        <register name="GMAC_IER" offset="0x28" rw="W" size="4" atomic-op="set:GMAC_IMR" caption="Interrupt Enable Register">
          <bitfield name="MFS" caption="Management Frame Sent" mask="0x1"/>
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded or Late Collision" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to System Bus Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="System Bus Error" mask="0x800"/>
          <bitfield name="PFNZ" caption="Pause Frame with Non-zero Pause Quantum Received" mask="0x1000"/>
          <bitfield name="PTZ" caption="Pause Time Zero" mask="0x2000"/>
          <bitfield name="PFTR" caption="Pause Frame Transmitted" mask="0x4000"/>
          <bitfield name="EXINT" caption="External Interrupt" mask="0x8000"/>
          <bitfield name="DRQFR" caption="PTP Delay Request Frame Received" mask="0x40000"/>
          <bitfield name="SFR" caption="PTP Sync Frame Received" mask="0x80000"/>
          <bitfield name="DRQFT" caption="PTP Delay Request Frame Transmitted" mask="0x100000"/>
          <bitfield name="SFT" caption="PTP Sync Frame Transmitted" mask="0x200000"/>
          <bitfield name="PDRQFR" caption="PDelay Request Frame Received" mask="0x400000"/>
          <bitfield name="PDRSFR" caption="PDelay Response Frame Received" mask="0x800000"/>
          <bitfield name="PDRQFT" caption="PDelay Request Frame Transmitted" mask="0x1000000"/>
          <bitfield name="PDRSFT" caption="PDelay Response Frame Transmitted" mask="0x2000000"/>
          <bitfield name="SRI" caption="TSU Seconds Register Increment" mask="0x4000000"/>
          <bitfield name="RXLPISBC" caption="Enable RX LPI Indication" mask="0x8000000"/>
          <bitfield name="WOL" caption="Wake On LAN" mask="0x10000000"/>
          <bitfield name="TSUTIMCOMP" caption="TSU Timer Comparison" mask="0x20000000"/>
        </register>
        <register name="GMAC_IDR" offset="0x2C" rw="W" size="4" atomic-op="clear:GMAC_IMR" caption="Interrupt Disable Register">
          <bitfield name="MFS" caption="Management Frame Sent" mask="0x1"/>
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded or Late Collision" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to System Bus Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="System Bus Error" mask="0x800"/>
          <bitfield name="PFNZ" caption="Pause Frame with Non-zero Pause Quantum Received" mask="0x1000"/>
          <bitfield name="PTZ" caption="Pause Time Zero" mask="0x2000"/>
          <bitfield name="PFTR" caption="Pause Frame Transmitted" mask="0x4000"/>
          <bitfield name="EXINT" caption="External Interrupt" mask="0x8000"/>
          <bitfield name="DRQFR" caption="PTP Delay Request Frame Received" mask="0x40000"/>
          <bitfield name="SFR" caption="PTP Sync Frame Received" mask="0x80000"/>
          <bitfield name="DRQFT" caption="PTP Delay Request Frame Transmitted" mask="0x100000"/>
          <bitfield name="SFT" caption="PTP Sync Frame Transmitted" mask="0x200000"/>
          <bitfield name="PDRQFR" caption="PDelay Request Frame Received" mask="0x400000"/>
          <bitfield name="PDRSFR" caption="PDelay Response Frame Received" mask="0x800000"/>
          <bitfield name="PDRQFT" caption="PDelay Request Frame Transmitted" mask="0x1000000"/>
          <bitfield name="PDRSFT" caption="PDelay Response Frame Transmitted" mask="0x2000000"/>
          <bitfield name="SRI" caption="TSU Seconds Register Increment" mask="0x4000000"/>
          <bitfield name="RXLPISBC" caption="Enable RX LPI Indication" mask="0x8000000"/>
          <bitfield name="WOL" caption="Wake On LAN" mask="0x10000000"/>
          <bitfield name="TSUTIMCOMP" caption="TSU Timer Comparison" mask="0x20000000"/>
        </register>
        <register name="GMAC_IMR" offset="0x30" rw="RW" size="4" initval="0x07FFFFFF" caption="Interrupt Mask Register">
          <bitfield name="MFS" caption="Management Frame Sent" mask="0x1"/>
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to System Bus Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="System Bus Error" mask="0x800"/>
          <bitfield name="PFNZ" caption="Pause Frame with Non-zero Pause Quantum Received" mask="0x1000"/>
          <bitfield name="PTZ" caption="Pause Time Zero" mask="0x2000"/>
          <bitfield name="PFTR" caption="Pause Frame Transmitted" mask="0x4000"/>
          <bitfield name="EXINT" caption="External Interrupt" mask="0x8000"/>
          <bitfield name="DRQFR" caption="PTP Delay Request Frame Received" mask="0x40000"/>
          <bitfield name="SFR" caption="PTP Sync Frame Received" mask="0x80000"/>
          <bitfield name="DRQFT" caption="PTP Delay Request Frame Transmitted" mask="0x100000"/>
          <bitfield name="SFT" caption="PTP Sync Frame Transmitted" mask="0x200000"/>
          <bitfield name="PDRQFR" caption="PDelay Request Frame Received" mask="0x400000"/>
          <bitfield name="PDRSFR" caption="PDelay Response Frame Received" mask="0x800000"/>
          <bitfield name="PDRQFT" caption="PDelay Request Frame Transmitted" mask="0x1000000"/>
          <bitfield name="PDRSFT" caption="PDelay Response Frame Transmitted" mask="0x2000000"/>
          <bitfield name="SRI" caption="TSU Seconds Register Increment" mask="0x4000000"/>
          <bitfield name="RXLPISBC" caption="Enable RX LPI Indication" mask="0x8000000"/>
          <bitfield name="WOL" caption="Wake On LAN" mask="0x10000000"/>
          <bitfield name="TSUTIMCOMP" caption="TSU Timer Comparison" mask="0x20000000"/>
        </register>
