Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D29.atdf
        <register name="GMAC_MAN" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="PHY Maintenance Register">
          <bitfield name="DATA" caption="PHY Data" mask="0xFFFF"/>
          <bitfield name="WTN" caption="Write Ten" mask="0x30000"/>
          <bitfield name="REGA" caption="Register Address" mask="0x7C0000"/>
          <bitfield name="PHYA" caption="PHY Address" mask="0xF800000"/>
          <bitfield name="OP" caption="Operation" mask="0x30000000" values="GMAC_MAN__OP"/>
          <bitfield name="CLTTO" caption="Clause 22 Operation" mask="0x40000000" values="GMAC_MAN__CLTTO"/>
          <bitfield name="WZO" caption="Write ZERO" mask="0x80000000"/>
        </register>
        <register name="GMAC_RPQ" offset="0x38" rw="R" size="4" initval="0x00000000" caption="Receive Pause Quantum Register">
          <bitfield name="RPQ" caption="Received Pause Quantum" mask="0xFFFF"/>
        </register>
        <register name="GMAC_TPQ" offset="0x3C" rw="RW" size="4" initval="0xFFFFFFFF" caption="Transmit Pause Quantum Register">
          <bitfield name="TPQ" caption="Transmit Pause Quantum" mask="0xFFFF"/>
          <bitfield name="P1TPQ" caption="Priority 1 Transmit Pause Quantum" mask="0xFFFF0000"/>
        </register>
        <register name="GMAC_RJFML" offset="0x48" rw="RW" size="4" initval="0x00003FFF" caption="RX Jumbo Frame Max Length Register">
          <bitfield name="FML" caption="Frame Max Length" mask="0x3FFF"/>
        </register>
        <register name="GMAC_INTM" offset="0x5C" rw="RW" size="4" initval="0x00000000" caption="Interrupt Moderation Register">
          <bitfield name="RXINTMOD" caption="Receive Interrupt Moderation" mask="0xFF"/>
          <bitfield name="TXINTMOD" caption="Transmit Interrupt Moderation" mask="0xFF0000"/>
        </register>
        <register name="GMAC_SYSWT" offset="0x60" rw="RW" size="4" initval="0x00000000" caption="System Wake-Up Time Register">
          <bitfield name="SYSWKUPTIME" caption="System Wake-up Time" mask="0xFFFF"/>
        </register>
        <register name="GMAC_HRB" offset="0x80" rw="RW" size="4" initval="0x00000000" caption="Hash Register Bottom">
          <bitfield name="ADDR" caption="Hash Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_HRT" offset="0x84" rw="RW" size="4" initval="0x00000000" caption="Hash Register Top">
          <bitfield name="ADDR" caption="Hash Address" mask="0xFFFFFFFF"/>
        </register>
        <register-group caption="Specific Address Register" offset="0x088" name="GMAC_SA" size="8" count="4" start-index="1" name-in-module="GMAC_SA"/>
        <register name="GMAC_TIDM1" offset="0xA8" rw="RW" size="4" initval="0x00000000" caption="Type ID Match 1 Register">
          <bitfield name="TID" caption="Type ID Match 1" mask="0xFFFF"/>
          <bitfield name="ENID1" caption="Enable Copying of TID Matched Frames" mask="0x80000000" values="GMAC_TIDM1__ENID1"/>
        </register>
        <register name="GMAC_TIDM2" offset="0xAC" rw="RW" size="4" initval="0x00000000" caption="Type ID Match 2 Register">
          <bitfield name="TID" caption="Type ID Match 2" mask="0xFFFF"/>
          <bitfield name="ENID2" caption="Enable Copying of TID Matched Frames" mask="0x80000000" values="GMAC_TIDM2__ENID2"/>
        </register>
        <register name="GMAC_TIDM3" offset="0xB0" rw="RW" size="4" initval="0x00000000" caption="Type ID Match 3 Register">
          <bitfield name="TID" caption="Type ID Match 3" mask="0xFFFF"/>
          <bitfield name="ENID3" caption="Enable Copying of TID Matched Frames" mask="0x80000000" values="GMAC_TIDM3__ENID3"/>
        </register>
        <register name="GMAC_TIDM4" offset="0xB4" rw="RW" size="4" initval="0x00000000" caption="Type ID Match 4 Register">
          <bitfield name="TID" caption="Type ID Match 4" mask="0xFFFF"/>
          <bitfield name="ENID4" caption="Enable Copying of TID Matched Frames" mask="0x80000000" values="GMAC_TIDM4__ENID4"/>
        </register>
        <register name="GMAC_WOL" offset="0xB8" rw="RW" size="4" initval="0x00000000" caption="Wake on LAN Register">
          <bitfield name="IP" caption="ARP Request IP Address" mask="0xFFFF"/>
          <bitfield name="MAG" caption="Magic Packet Event Enable" mask="0x10000"/>
          <bitfield name="ARP" caption="ARP Request Event Enable" mask="0x20000"/>
          <bitfield name="SA1" caption="Specific Address Register 1 Event Enable" mask="0x40000"/>
          <bitfield name="MTI" caption="Multicast Hash Event Enable" mask="0x80000"/>
        </register>
        <register name="GMAC_IPGS" offset="0xBC" rw="RW" size="4" initval="0x00000000" caption="IPG Stretch Register">
          <bitfield name="FL" caption="Frame Length" mask="0xFFFF"/>
        </register>
        <register name="GMAC_SVLAN" offset="0xC0" rw="RW" size="4" initval="0x00000000" caption="Stacked VLAN Register">
          <bitfield name="VLAN_TYPE" caption="User Defined VLAN_TYPE Field" mask="0xFFFF"/>
          <bitfield name="ESVLAN" caption="Enable Stacked VLAN Processing Mode" mask="0x80000000" values="GMAC_SVLAN__ESVLAN"/>
        </register>
        <register name="GMAC_TPFCP" offset="0xC4" rw="RW" size="4" initval="0x00000000" caption="Transmit PFC Pause Register">
          <bitfield name="PEV" caption="Priority Enable Vector" mask="0xFF"/>
          <bitfield name="PQ" caption="Pause Quantum" mask="0xFF00"/>
        </register>
        <register name="GMAC_SAMB1" offset="0xC8" rw="RW" size="4" initval="0x00000000" caption="Specific Address 1 Mask Bottom Register">
          <bitfield name="ADDR" caption="Specific Address 1 Mask" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_SAMT1" offset="0xCC" rw="RW" size="4" initval="0x00000000" caption="Specific Address 1 Mask Top Register">
          <bitfield name="ADDR" caption="Specific Address 1 Mask" mask="0xFFFF"/>
        </register>
        <register name="GMAC_AMRX" offset="0xD0" rw="RW" size="4" initval="0x00000000" caption="System Memory Address Mask for RX Data Buffer Accesses Register">
          <bitfield name="MSBADDRMSK" caption="Mask of the Receive Data Buffer Address" mask="0xF"/>
          <bitfield name="MSBADDR" caption="MSB of the Receive Data Buffer Address" mask="0xF0000000"/>
        </register>
        <register name="GMAC_RXUDAR" offset="0xD4" rw="RW" size="4" initval="0x00000000" caption="PTP RX Unicast IP Destination Address Register">
          <bitfield name="RXUDA" caption="Receive Unicast Destination Address" mask="0xFFFFFFFF"/>
        </register>
