Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D29.atdf
        <register name="GMAC_TQUBA" offset="0x4C8" rw="RW" size="4" initval="0x00000000" caption="32 MSB Transmit Buffer Descriptor Queue Base Address Register">
          <bitfield name="TQUBA" caption="Transmit Queue Upper Buffer Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_TXBDCTRL" offset="0x4CC" rw="RW" size="4" initval="0x00000000" caption="Transmit Buffer Data Control Register">
          <bitfield name="TSMODE" caption="Transmit Descriptor Timestamp Insertion Mode" mask="0x30" values="GMAC_TXBDCTRL__TSMODE"/>
        </register>
        <register name="GMAC_RXBDCTRL" offset="0x4D0" rw="RW" size="4" initval="0x00000000" caption="Receive Buffer Data Control Register">
          <bitfield name="TSMODE" caption="Receive Descriptor Timestamp Insertion Mode" mask="0x30" values="GMAC_RXBDCTRL__TSMODE"/>
        </register>
        <register name="GMAC_RQUBA" offset="0x4D4" rw="RW" size="4" initval="0x00000000" caption="32 MSB Receive Buffer Descriptor Queue Base Address Register">
          <bitfield name="RQUBA" caption="Receive Queue Upper Buffer Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="GMAC_ST1RPQ" offset="0x500" rw="RW" size="4" initval="0x00000000" caption="Screening Type 1 Register Priority Queue (index = 0)">
          <bitfield name="QNB" caption="Queue Number (0-2)" mask="0x7"/>
          <bitfield name="DSTCM" caption="Differentiated Services or Traffic Class Match" mask="0xFF0"/>
          <bitfield name="UDPM" caption="UDP Port Match" mask="0xFFFF000"/>
          <bitfield name="DSTCE" caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000"/>
          <bitfield name="UDPE" caption="UDP Port Match Enable" mask="0x20000000"/>
        </register>
        <register name="GMAC_ST2RPQ" offset="0x540" rw="RW" size="4" initval="0x00000000" caption="Screening Type 2 Register Priority Queue (index = 0)">
          <bitfield name="QNB" caption="Queue Number (0-2)" mask="0x7"/>
          <bitfield name="VLANP" caption="VLAN Priority" mask="0x70"/>
          <bitfield name="VLANE" caption="VLAN Enable" mask="0x100" values="GMAC_ST2RPQ__VLANE"/>
          <bitfield name="I2ETH" caption="Index of Screening Type 2 EtherType register" mask="0xE00"/>
          <bitfield name="ETHE" caption="EtherType Enable" mask="0x1000" values="GMAC_ST2RPQ__ETHE"/>
          <bitfield name="COMPA" caption="Index of Screening Type 2 Compare Word 0/Word 1 register" mask="0x3E000"/>
          <bitfield name="COMPAE" caption="Compare A Enable" mask="0x40000" values="GMAC_ST2RPQ__COMPAE"/>
          <bitfield name="COMPB" caption="Index of Screening Type 2 Compare Word 0/Word 1 register" mask="0xF80000"/>
          <bitfield name="COMPBE" caption="Compare B Enable" mask="0x1000000" values="GMAC_ST2RPQ__COMPBE"/>
          <bitfield name="COMPC" caption="Index of Screening Type 2 Compare Word 0/Word 1 register" mask="0x3E000000"/>
          <bitfield name="COMPCE" caption="Compare C Enable" mask="0x40000000" values="GMAC_ST2RPQ__COMPCE"/>
        </register>
        <register name="GMAC_TSCTL" offset="0x580" rw="RW" size="4" initval="0x00000000" caption="Transmit Schedule Control Register">
          <bitfield name="TXSQ0" caption="Transmit Schedule for Qx" mask="0x3" values="GMAC_TSCTL__TXSQ"/>
          <bitfield name="TXSQ1" caption="Transmit Schedule for Qx" mask="0xC" values="GMAC_TSCTL__TXSQ"/>
          <bitfield name="TXSQ2" caption="Transmit Schedule for Qx" mask="0x30" values="GMAC_TSCTL__TXSQ"/>
          <bitfield name="TXSQ3" caption="Transmit Schedule for Qx" mask="0xC0" values="GMAC_TSCTL__TXSQ"/>
          <bitfield name="TXSQ4" caption="Transmit Schedule for Qx" mask="0x300" values="GMAC_TSCTL__TXSQ"/>
          <bitfield name="TXSQ5" caption="Transmit Schedule for Qx" mask="0xC00" values="GMAC_TSCTL__TXSQ"/>
        </register>
        <register name="GMAC_TQBWRL0" offset="0x590" rw="RW" size="4" initval="0x00000000" caption="Transmit Queue Bandwidth Rate Limit 0 Register">
          <bitfield name="ALLOCQ0" caption="DWRR Weighting or ETS Bandwidth Allocation for Qx" mask="0xFF"/>
          <bitfield name="ALLOCQ1" caption="DWRR Weighting or ETS Bandwidth Allocation for Qx" mask="0xFF00"/>
          <bitfield name="ALLOCQ2" caption="DWRR Weighting or ETS Bandwidth Allocation for Qx" mask="0xFF0000"/>
          <bitfield name="ALLOCQ3" caption="DWRR Weighting or ETS Bandwidth Allocation for Qx" mask="0xFF000000"/>
        </register>
        <register name="GMAC_TQSA" offset="0x5A0" rw="RW" size="4" initval="0x00000000" caption="Transmit Queue Segment Allocation Register">
          <bitfield name="SEGALLOCQ0" caption="Segment Allocation for Qx" mask="0x7"/>
          <bitfield name="SEGALLOCQ1" caption="Segment Allocation for Qx" mask="0x70"/>
          <bitfield name="SEGALLOCQ2" caption="Segment Allocation for Qx" mask="0x700"/>
          <bitfield name="SEGALLOCQ3" caption="Segment Allocation for Qx" mask="0x7000"/>
          <bitfield name="SEGALLOCQ4" caption="Segment Allocation for Qx" mask="0x70000"/>
          <bitfield name="SEGALLOCQ5" caption="Segment Allocation for Qx" mask="0x700000"/>
        </register>
        <register name="GMAC_IERPQ" offset="0x600" rw="W" size="4" atomic-op="set:GMAC_IMRPQ" count="2" caption="Interrupt Enable Register Priority Queue (index = 1)">
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded or Late Collision" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to System Bus Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="HRESP" caption="System Bus Error" mask="0x800"/>
        </register>
        <register name="GMAC_IDRPQ" offset="0x620" rw="W" size="4" atomic-op="clear:GMAC_IMRPQ" count="2" caption="Interrupt Disable Register Priority Queue (index = 1)">
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded or Late Collision" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to System Bus Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="HRESP" caption="System Bus Error" mask="0x800"/>
        </register>
        <register name="GMAC_IMRPQ" offset="0x640" rw="RW" size="4" count="2" initval="0x00000000" caption="Interrupt Mask Register Priority Queue (index = 1)">
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded or Late Collision" mask="0x20"/>
          <bitfield name="AHB" caption="Transmit Frame Corruption Due to System Bus Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="HRESP" caption="System Bus Error" mask="0x800"/>
        </register>
        <register name="GMAC_ST2ER" offset="0x6E0" rw="RW" size="4" initval="0x00000000" caption="Screening Type 2 Ethertype Register (index = 0)">
          <bitfield name="COMPVAL" caption="Ethertype Compare Value" mask="0xFFFF"/>
        </register>
        <register-group name="GMAC_ST2CW" name-in-module="GMAC_ST2CW" offset="0x700" size="0x08" count="1"/>
      </register-group>
      <value-group name="GMAC_ST2CW1R__OFFSSTRT">
        <value name="FRAMESTART" caption="Offset from the start of the frame" value="0"/>
        <value name="ETHERTYPE" caption="Offset from the byte after the EtherType field" value="1"/>
        <value name="IP" caption="Offset from the byte after the IP header field" value="2"/>
        <value name="TCP_UDP" caption="Offset from the byte after the TCP/UDP header field" value="3"/>
      </value-group>
      <value-group name="GMAC_ST2CW1R__DISMASK">
        <value name="0" caption="GMAC_ST2CW0R contains a 2-byte compare value with a 2-byte mask value." value="0"/>
        <value name="1" caption="GMAC_ST2CW0R contains a 4-byte compare value." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__LBL">
        <value name="0" caption="Normal operating mode (no loop back)." value="0"/>
        <value name="1" caption="Connects GTX to GRX, GTXEN to GRXDV and forces Full Duplex mode. GRXCK and GTXCK may malfunction as the GMAC is switched into and out of internal loop back. It is important that receive and transmit circuits have already been disabled when making the switch into and out of internal loop back." value="1"/>
      </value-group>
