Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D29.atdf
      <value-group name="GMAC_NCR__RXEN">
        <value name="0" caption="Stops frame reception immediately and the receive pipeline will be cleared. The Receive Queue Pointer register is unaffected." value="0"/>
        <value name="1" caption="Enables the GMAC to receive data." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__TXEN">
        <value name="0" caption="Stops transmission immediately, the transmit pipeline and control registers will be cleared and the Transmit Queue Pointer Register will reset to point to the start of the transmit descriptor list." value="0"/>
        <value name="1" caption="Enables the GMAC transmitter to send data." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__MPE">
        <value name="0" caption="Forces GMDIO to high impedance state and MDC low." value="0"/>
        <value name="1" caption="Enables the management port." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__CLRSTAT">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Clears the statistics registers." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__WESTAT">
        <value name="0" caption="Forces the statistics registers to be in read-only mode for normal operation mode." value="0"/>
        <value name="1" caption="Makes the statistics registers writable for functional test purposes." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__BP">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="When the MAC is set in 10M or 100M Half Duplex mode, forces collisions on all received frames." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__TSTART">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Starts transmission." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__THALT">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Halts transmission as soon as any ongoing frame transmission ends." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__TXPF">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Generates a pause frame to be transmitted." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__TXZQPF">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Generates a pause frame with zero quantum to be transmitted." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__SRTSM">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Causes the CRC of every received frame to be replaced with the value of the nanoseconds field of the 1588 timer that was captured as the receive frame passed the message timestamp point. Note that bit RFCS in register GMAC_NCFGR may not be set to 1 when the timer should be captured." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__TXPBPF">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Takes the values stored in the Transmit PFC Pause Register." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__FNP">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Flushes the next packet from the receive memory. This will only have an effect if the DMA is not currently writing a packet already stored in the receive memory to system memory." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__PTPUNIENA">
        <value name="0" caption="Disables detection of unicast PTP frames." value="0"/>
        <value name="1" caption="Enables detection of unicast PTP frames." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__STUDPOFFSET">
        <value name="0" caption="Normal operations." value="0"/>
        <value name="1" caption="The upper 16 bits of the CRC of every received frame are replaced with the offset from start of frame to the beginning of the UDP or TCP header. The lower 16 bits of the CRC are replaced with zero and reserved for future use. The offset is measured in units of 2 bytes." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__OSSMODE">
        <value name="0" caption="1588 One Step Sync Mode is disabled." value="0"/>
        <value name="1" caption="1588 One Step Sync Mode is enabled. Replaces timestamp field in the 1588 header for TX Sync Frames with the current TSU timer value." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__PFCCTL">
        <value name="0" caption="Disables multiple PFC pause quantums." value="0"/>
        <value name="1" caption="Enables multiple PFC pause quantums, one per pause priority." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__EXTSELRQEN">
        <value name="0" caption="Disables external selection of receive queue." value="0"/>
        <value name="1" caption="Enables external selection of receive queue." value="1"/>
      </value-group>
      <value-group name="GMAC_NCR__MIIONRGMII">
        <value name="0" caption="Disables MII operation." value="0"/>
      </value-group>
      <value-group name="GMAC_NCR__IFGQAVCRED">
        <value name="0" caption="No modification of the CBS algorithm." value="0"/>
        <value name="1" caption="Modifies the CBS algorithm so the IFG/IPG associated with a transmit frame counts towards its 802.1Qav credit." value="1"/>
      </value-group>
      <value-group name="GMAC_NCFGR__CLK">
        <value name="MCK_8" caption="MCK divided by 8 (MCK up to 20 MHz)" value="0"/>
        <value name="MCK_16" caption="MCK divided by 16 (MCK up to 40 MHz)" value="1"/>
        <value name="MCK_32" caption="MCK divided by 32 (MCK up to 80 MHz)" value="2"/>
        <value name="MCK_48" caption="MCK divided by 48 (MCK up to 120 MHz)" value="3"/>
        <value name="MCK_64" caption="MCK divided by 64 (MCK up to 160 MHz)" value="4"/>
        <value name="MCK_96" caption="MCK divided by 96 (MCK up to 240 MHz)" value="5"/>
      </value-group>
      <value-group name="GMAC_UR__RMII">
        <value name="1" caption="RMII mode is selected." value="1"/>
      </value-group>
