Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D29.atdf
      <value-group name="GMAC_UR__HDFLCTLEN">
        <value name="0" caption="Half duplex flow control is disabled." value="0"/>
        <value name="1" caption="Half duplex flow control is enabled." value="1"/>
      </value-group>
      <value-group name="GMAC_DCFGR__FBLDO">
        <value name="SINGLE" caption="Always use single access on system bus" value="1"/>
        <value name="INCR4" caption="Attempt to use 4-beat bursts on system bus (Default)" value="4"/>
        <value name="INCR8" caption="Attempt to use 8-beat bursts on system bus bursts" value="8"/>
        <value name="INCR16" caption="Attempt to use 16-beat bursts on system bus bursts" value="16"/>
      </value-group>
      <value-group name="GMAC_DCFGR__ESMA">
        <value name="LITTLE_ENDIAN" caption="Selects Little-endian endianism for system bus transfers." value="0"/>
        <value name="BIG_ENDIAN" caption="Selects swapped endianism for system bus transfers." value="1"/>
      </value-group>
      <value-group name="GMAC_DCFGR__ESPA">
        <value name="LITTLE_ENDIAN" caption="Selects Little-endian endianism for system bus transfers." value="0"/>
        <value name="BIG_ENDIAN" caption="Selects swapped endianism for system bus transfers." value="1"/>
      </value-group>
      <value-group name="GMAC_DCFGR__RXBMS">
        <value name="EIGHTH" caption="4/8 Kbyte Memory Size" value="0"/>
        <value name="QUARTER" caption="4/4 Kbytes Memory Size" value="1"/>
        <value name="HALF" caption="4/2 Kbytes Memory Size" value="2"/>
        <value name="FULL" caption="4 Kbytes Memory Size" value="3"/>
      </value-group>
      <value-group name="GMAC_DCFGR__TXPBMS">
        <value name="TWO_KB" caption="Do not use top address bit (2 Kbytes)." value="0"/>
        <value name="FOUR_KB" caption="Use full configured addressable space (4 Kbytes)." value="1"/>
      </value-group>
      <value-group name="GMAC_DCFGR__CRCERRREP">
        <value name="0" caption="Bit 16 of the receive buffer descriptor represents the Canonical format indicator (CFI) bit as extracted from the receive frame (if the receive buffer descriptor is pointing to the last data buffer of the receive frame and the received frame was VLAN tagged)." value="0"/>
        <value name="1" caption="Bit 16 of the receive buffer descriptor represents the FCS/CRC error (only if frames with FCS are copied to memory as enabled by bit 26 in the Network Configuration register)." value="1"/>
      </value-group>
      <value-group name="GMAC_DCFGR__DRBS">
        <value name="0x02" caption="128 bytes" value="0x02"/>
        <value name="0x18" caption="1536 bytes (1 x max length frame/buffer)" value="0x18"/>
        <value name="0xA0" caption="10240 bytes (1 x 10K jumbo frame/buffer)" value="0xA0"/>
      </value-group>
      <value-group name="GMAC_DCFGR__RXBD_EXTENDED">
        <value name="0" caption="Disables Receive Buffer Data Extended mode." value="0"/>
        <value name="1" caption="Enables Receive Buffer Data Extended mode." value="1"/>
      </value-group>
      <value-group name="GMAC_DCFGR__TXBD_EXTENDED">
        <value name="0" caption="Disables Transmit Buffer Data Extended mode." value="0"/>
        <value name="1" caption="Enables Transmit Buffer Data Extended mode." value="1"/>
      </value-group>
      <value-group name="GMAC_RBQB__RXQDIS">
        <value name="0" caption="Queue is enabled." value="0"/>
        <value name="1" caption="Queue is disabled. Used to reduce the number of active queues and should only be changed while receive is not enabled." value="1"/>
      </value-group>
      <value-group name="GMAC_TBQB__TXQDIS">
        <value name="0" caption="Queue is enabled." value="0"/>
        <value name="1" caption="Queue is disabled. Used to reduce the number of active queues and should only be changed while transmit is not enabled." value="1"/>
      </value-group>
      <value-group name="GMAC_MAN__OP">
        <value name="1" caption="Write" value="1"/>
        <value name="2" caption="Read" value="2"/>
      </value-group>
      <value-group name="GMAC_MAN__CLTTO">
        <value name="0" caption="Clause 45 operation" value="0"/>
        <value name="1" caption="Clause 22 operation" value="1"/>
      </value-group>
      <value-group name="GMAC_SAT__FILTSORD">
        <value name="0" caption="The filter is a destination address filter." value="0"/>
        <value name="1" caption="The filter is a source address filter." value="1"/>
      </value-group>
      <value-group name="GMAC_SAT__FILTBMASK">
        <value name="BIT1" caption="Controls whether the first byte has been received." value="0x1"/>
        <value name="BIT2" caption="Controls whether the second byte has been received." value="0x2"/>
        <value name="BIT3" caption="Controls whether the third byte has been received." value="0x4"/>
        <value name="BIT4" caption="Controls whether the fourth byte has been received." value="0x8"/>
        <value name="BIT5" caption="Controls whether the fifth byte has been received." value="0x10"/>
        <value name="BIT6" caption="Controls whether the sixth byte has been received" value="0x20"/>
      </value-group>
      <value-group name="GMAC_TIDM1__ENID1">
        <value name="0" caption="TID is not part of the comparison match." value="0"/>
        <value name="1" caption="TID is processed for the comparison match." value="1"/>
      </value-group>
      <value-group name="GMAC_TIDM2__ENID2">
        <value name="0" caption="TID is not part of the comparison match." value="0"/>
        <value name="1" caption="TID is processed for the comparison match." value="1"/>
      </value-group>
      <value-group name="GMAC_TIDM3__ENID3">
        <value name="0" caption="TID is not part of the comparison match." value="0"/>
        <value name="1" caption="TID is processed for the comparison match." value="1"/>
      </value-group>
      <value-group name="GMAC_TIDM4__ENID4">
        <value name="0" caption="TID is not part of the comparison match." value="0"/>
        <value name="1" caption="TID is processed for the comparison match." value="1"/>
      </value-group>
