Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D29.atdf
      <value-group name="GMAC_SVLAN__ESVLAN">
        <value name="0" caption="Disable the stacked VLAN Processing mode" value="0"/>
        <value name="1" caption="Enable the stacked VLAN Processing mode" value="1"/>
      </value-group>
      <value-group name="GMAC_RBSRPQ__RBS">
        <value name="0x02" caption="128 bytes" value="0x02"/>
        <value name="0x18" caption="1536 bytes (1 x max length frame/buffer)" value="0x18"/>
        <value name="0xA0" caption="10240 bytes (1 x 10K jumbo frame/buffer)" value="0xA0"/>
      </value-group>
      <value-group name="GMAC_CBSCR__QAE">
        <value name="0" caption="Credit-based shaping on the second highest priority queue (queue A) is disabled." value="0"/>
        <value name="1" caption="Credit-based shaping on the second highest priority queue (queue A) is enabled." value="1"/>
      </value-group>
      <value-group name="GMAC_CBSCR__QBE">
        <value name="0" caption="Credit-based shaping on the highest priority queue (queue B) is disabled." value="0"/>
        <value name="1" caption="Credit-based shaping on the highest priority queue (queue B) is enabled." value="1"/>
      </value-group>
      <value-group name="GMAC_TXBDCTRL__TSMODE">
        <value name="DISABLE" caption="Timestamp insertion disable." value="0"/>
        <value name="PTPEVENT" caption="Timestamp inserted for PTP Event Frames only." value="1"/>
        <value name="PTPALL" caption="Timestamp inserted for All PTP Frames only." value="2"/>
        <value name="ALL" caption="Timestamp inserted for All Frames." value="3"/>
      </value-group>
      <value-group name="GMAC_RXBDCTRL__TSMODE">
        <value name="DISABLE" caption="Timestamp insertion disable." value="0"/>
        <value name="PTPEVENT" caption="Timestamp inserted for PTP Event Frames only." value="1"/>
        <value name="PTPALL" caption="Timestamp inserted for All PTP Frames only." value="2"/>
        <value name="ALL" caption="Timestamp inserted for All Frames." value="3"/>
      </value-group>
      <value-group name="GMAC_ST2RPQ__VLANE">
        <value name="0" caption="VLAN match is disabled." value="0"/>
        <value name="1" caption="VLAN match is enabled." value="1"/>
      </value-group>
      <value-group name="GMAC_ST2RPQ__ETHE">
        <value name="0" caption="EtherType match with bits 15:0 in the register designated by the value of I2ETH is disabled." value="0"/>
        <value name="1" caption="EtherType match with bits 15:0 in the register designated by the value of I2ETH is enabled." value="1"/>
      </value-group>
      <value-group name="GMAC_ST2RPQ__COMPAE">
        <value name="0" caption="Comparison via the register designated by index COMPA is disabled." value="0"/>
        <value name="1" caption="Comparison via the register designated by index COMPA is enabled." value="1"/>
      </value-group>
      <value-group name="GMAC_ST2RPQ__COMPBE">
        <value name="0" caption="Comparison via the register designated by index COMPB is disabled." value="0"/>
        <value name="1" caption="Comparison via the register designated by index COMPB is enabled." value="1"/>
      </value-group>
      <value-group name="GMAC_ST2RPQ__COMPCE">
        <value name="0" caption="Comparison via the register designated by index COMPC is disabled." value="0"/>
        <value name="1" caption="Comparison via the register designated by index COMPC is enabled." value="1"/>
      </value-group>
      <value-group name="GMAC_TSCTL__TXSQ">
        <value name="FP" caption="Fixed Priority" value="0"/>
        <value name="CBS" caption="CBS Enabled only valid for top two enabled queues and if CBS capability selected." value="1"/>
        <value name="DWRR" caption="DWRR enabled" value="2"/>
        <value name="ETS" caption="ETS enabled" value="3"/>
      </value-group>
    </module>
    <module caption="Inter-IC Sound Controller" id="11241" name="I2SC" version="N">
      <register-group name="I2SC">
        <register caption="Control Register" name="I2SC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Receiver Enable" mask="0x00000001" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000002" name="RXDIS"/>
          <bitfield caption="Clocks Enable" mask="0x00000004" name="CKEN"/>
          <bitfield caption="Clocks Disable" mask="0x00000008" name="CKDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000010" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000020" name="TXDIS"/>
          <bitfield caption="Software Reset" mask="0x00000080" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="I2SC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Inter-IC Sound Controller Mode" mask="0x00000001" name="MODE" values="I2SC_MR__MODE"/>
          <bitfield caption="Data Word Length" mask="0x0000001C" name="DATALENGTH" values="I2SC_MR__DATALENGTH"/>
          <bitfield caption="Data Format" mask="0x000000C0" name="FORMAT" values="I2SC_MR__FORMAT"/>
          <bitfield caption="Receive Mono" mask="0x00000100" name="RXMONO"/>
          <bitfield caption="Loopback Test Mode" mask="0x00000400" name="RXLOOP"/>
          <bitfield caption="Transmit Mono" mask="0x00001000" name="TXMONO"/>
          <bitfield caption="Transmit Data when Underrun" mask="0x00004000" name="TXSAME"/>
          <bitfield caption="Selected Clock to I2SC Master Clock Ratio" mask="0x003F0000" name="IMCKDIV"/>
          <bitfield caption="Master Clock to fs Ratio" mask="0x3F000000" name="IMCKFS" values="I2SC_MR__IMCKFS"/>
          <bitfield caption="Master Clock Mode" mask="0x40000000" name="IMCKMODE"/>
          <bitfield caption="I2SC_WS Slot Width" mask="0x80000000" name="IWS"/>
        </register>
        <register caption="Status Register" name="I2SC_SR" offset="0x08" rw="R" size="4">
          <bitfield caption="Receiver Enabled" mask="0x00000001" name="RXEN"/>
          <bitfield caption="Receive Ready" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Receive Overrun" mask="0x00000004" name="RXOR"/>
          <bitfield caption="Transmitter Enabled" mask="0x00000010" name="TXEN"/>
          <bitfield caption="Transmit Ready" mask="0x00000020" name="TXRDY"/>
          <bitfield caption="Transmit Underrun" mask="0x00000040" name="TXUR"/>
          <bitfield caption="Receive Overrun Channel" mask="0x00000300" name="RXORCH"/>
          <bitfield caption="Transmit Underrun Channel" mask="0x00300000" name="TXURCH"/>
        </register>
        <register caption="Status Clear Register" name="I2SC_SCR" offset="0x0C" rw="W" size="4">
          <bitfield caption="Receive Overrun Status Clear" mask="0x00000004" name="RXOR"/>
          <bitfield caption="Transmit Underrun Status Clear" mask="0x00000040" name="TXUR"/>
          <bitfield caption="Receive Overrun Per Channel Status Clear" mask="0x00000300" name="RXORCH"/>
          <bitfield caption="Transmit Underrun Per Channel Status Clear" mask="0x00300000" name="TXURCH"/>
        </register>
        <register caption="Status Set Register" name="I2SC_SSR" offset="0x10" rw="W" size="4">
          <bitfield caption="Receive Overrun Status Set" mask="0x00000004" name="RXOR"/>
          <bitfield caption="Transmit Underrun Status Set" mask="0x00000040" name="TXUR"/>
          <bitfield caption="Receive Overrun Per Channel Status Set" mask="0x00000300" name="RXORCH"/>
          <bitfield caption="Transmit Underrun Per Channel Status Set" mask="0x00300000" name="TXURCH"/>
        </register>
