Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D29.atdf
        <register caption="Contrast and Brightness Control Register" name="ISC_CBC_CTRL" offset="0x3B4" rw="RW" size="4">
          <bitfield caption="Contrast and Brightness Control Enable" mask="0x00000001" name="ENABLE"/>
        </register>
        <register caption="Contrast and Brightness Configuration Register" name="ISC_CBC_CFG" offset="0x3B8" rw="RW" size="4">
          <bitfield caption="CCIR656 Stream Enable" mask="0x00000001" name="CCIR"/>
          <bitfield caption="CCIR656 Byte Ordering" mask="0x00000006" name="CCIRMODE" values="ISC_CBC_CFG__CCIRMODE"/>
        </register>
        <register caption="Contrast and Brightness, Brightness Register" name="ISC_CBC_BRIGHT" offset="0x3BC" rw="RW" size="4">
          <bitfield caption="Brightness Control (signed 11 bits 1:10:0)" mask="0x000007FF" name="BRIGHT"/>
        </register>
        <register caption="Contrast and Brightness, Contrast Register" name="ISC_CBC_CONTRAST" offset="0x3C0" rw="RW" size="4">
          <bitfield caption="Contrast (unsigned 12 bits 0:4:8)" mask="0x00000FFF" name="CONTRAST"/>
        </register>
        <register caption="Subsampling 4:4:4 to 4:2:2 Control Register" name="ISC_SUB422_CTRL" offset="0x3C4" rw="RW" size="4">
          <bitfield caption="4:4:4 to 4:2:2 Chrominance Horizontal Subsampling Filter Enable" mask="0x00000001" name="ENABLE"/>
        </register>
        <register caption="Subsampling 4:4:4 to 4:2:2 Configuration Register" name="ISC_SUB422_CFG" offset="0x3C8" rw="RW" size="4">
          <bitfield caption="CCIR656 Input Stream" mask="0x00000001" name="CCIR"/>
          <bitfield caption="CCIR656 Byte Ordering" mask="0x00000006" name="CCIRMODE" values="ISC_SUB422_CFG__CCIRMODE"/>
          <bitfield caption="Low Pass Filter Selection" mask="0x00000030" name="FILTER" values="ISC_SUB422_CFG__FILTER"/>
        </register>
        <register caption="Subsampling 4:2:2 to 4:2:0 Control Register" name="ISC_SUB420_CTRL" offset="0x3CC" rw="RW" size="4">
          <bitfield caption="4:2:2 to 4:2:0 Vertical Subsampling Filter Enable (Center Aligned)" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="Interlaced or Progressive Chrominance Filter" mask="0x00000010" name="FILTER"/>
        </register>
        <register caption="Rounding, Limiting and Packing Configuration Register" name="ISC_RLP_CFG" offset="0x3D0" rw="RW" size="4">
          <bitfield caption="Rounding, Limiting and Packing Mode" mask="0x0000000F" name="MODE" values="ISC_RLP_CFG__MODE"/>
          <bitfield caption="Alpha Value for Alpha-enabled RGB Mode" mask="0x0000FF00" name="ALPHA"/>
        </register>
        <register caption="Histogram Control Register" name="ISC_HIS_CTRL" offset="0x3D4" rw="RW" size="4">
          <bitfield caption="Histogram Sub Module Enable" mask="0x00000001" name="ENABLE"/>
        </register>
        <register caption="Histogram Configuration Register" name="ISC_HIS_CFG" offset="0x3D8" rw="RW" size="4">
          <bitfield caption="Histogram Operating Mode" mask="0x00000007" name="MODE" values="ISC_HIS_CFG__MODE"/>
          <bitfield caption="Bayer Color Component Selection" mask="0x00000030" name="BAYSEL" values="ISC_HIS_CFG__BAYSEL"/>
          <bitfield caption="Histogram Reset After Read" mask="0x00000100" name="RAR"/>
        </register>
        <register caption="DMA Configuration Register" name="ISC_DCFG" offset="0x3E0" rw="RW" size="4">
          <bitfield caption="DMA Input Mode Selection" mask="0x00000007" name="IMODE" values="ISC_DCFG__IMODE"/>
          <bitfield caption="DMA Memory Burst Size Y channel" mask="0x00000030" name="YMBSIZE" values="ISC_DCFG__YMBSIZE"/>
          <bitfield caption="DMA Memory Burst Size C channel" mask="0x00000300" name="CMBSIZE" values="ISC_DCFG__CMBSIZE"/>
        </register>
        <register caption="DMA Control Register" name="ISC_DCTRL" offset="0x3E4" rw="RW" size="4">
          <bitfield caption="Descriptor Enable" mask="0x00000001" name="DE"/>
          <bitfield caption="Descriptor View" mask="0x00000006" name="DVIEW" values="ISC_DCTRL__DVIEW"/>
          <bitfield caption="Interrupt Enable" mask="0x00000010" name="IE"/>
          <bitfield caption="Write Back Operation Enable" mask="0x00000020" name="WB"/>
          <bitfield caption="Value of Captured Frame Field Signal(1)(2)" mask="0x00000040" name="FIELD"/>
          <bitfield caption="Descriptor Processing Status(2)" mask="0x00000080" name="DONE"/>
        </register>
        <register caption="DMA Descriptor Address Register" name="ISC_DNDA" offset="0x3E8" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address Register" mask="0xFFFFFFFC" name="NDA"/>
        </register>
        <register-group count="3" name="ISC_SUB0" name-in-module="ISC_SUB0" offset="0x3EC" size="8"/>
        <register caption="Histogram Entry" count="512" name="ISC_HIS_ENTRY" offset="0x410" rw="R" size="4">
          <bitfield caption="Entry Counter" mask="0x000FFFFF" name="COUNT"/>
        </register>
      </register-group>
      <value-group caption="Parallel Front End Mode" name="ISC_PFE_CFG0__MODE">
        <value caption="Video source is progressive." name="PROGRESSIVE" value="0x0"/>
        <value caption="Video source is interlaced, two fields are captured starting with top field." name="DF_TOP" value="0x1"/>
        <value caption="Video source is interlaced, two fields are captured starting with bottom field." name="DF_BOTTOM" value="0x2"/>
        <value caption="Video source is interlaced, two fields are captured immediately." name="DF_IMMEDIATE" value="0x3"/>
        <value caption="Video source is interlaced, one field is captured starting with the top field." name="SF_TOP" value="0x4"/>
        <value caption="Video source is interlaced, one field is captured starting with the bottom field." name="SF_BOTTOM" value="0x5"/>
        <value caption="Video source is interlaced, one field is captured starting immediately." name="SF_IMMEDIATE" value="0x6"/>
      </value-group>
      <value-group caption="Bits Per Sample" name="ISC_PFE_CFG0__BPS">
        <value caption="12-bit input" name="TWELVE" value="0x0"/>
        <value caption="11-bit input" name="ELEVEN" value="0x1"/>
        <value caption="10-bit input" name="TEN" value="0x2"/>
        <value caption="9-bit input" name="NINE" value="0x3"/>
        <value caption="8-bit input" name="EIGHT" value="0x4"/>
      </value-group>
      <value-group caption="Write Channel Error Identifier" name="ISC_INTSR__WERRID">
        <value caption="An error occurred for Channel 0 (RAW/RGB/Y)" name="CH0" value="0x0"/>
        <value caption="An error occurred for Channel 1 (CbCr/Cb)" name="CH1" value="0x1"/>
        <value caption="An error occurred for Channel 2 (Cr)" name="CH2" value="0x2"/>
        <value caption="Write back channel error" name="WB" value="0x3"/>
      </value-group>
      <value-group caption="White Balance Bayer Configuration (Pixel Color Pattern)" name="ISC_WB_CFG__BAYCFG">
        <value caption="Starting Row configuration is G R G R (Red Row)" name="GRGR" value="0x0"/>
        <value caption="Starting Row configuration is R G R G (Red Row)" name="RGRG" value="0x1"/>
        <value caption="Starting Row configuration is G B G B (Blue Row)" name="GBGB" value="0x2"/>
        <value caption="Starting Row configuration is B G B G (Blue Row)" name="BGBG" value="0x3"/>
      </value-group>
      <value-group caption="Color Filter Array Pattern" name="ISC_CFA_CFG__BAYCFG">
        <value caption="Starting row configuration is G R G R (red row)" name="GRGR" value="0x0"/>
        <value caption="Starting row configuration is R G R G (red row" name="RGRG" value="0x1"/>
        <value caption="Starting row configuration is G B G B (blue row)" name="GBGB" value="0x2"/>
        <value caption="Starting row configuration is B G B G (blue row)" name="BGBG" value="0x3"/>
      </value-group>
      <value-group caption="CCIR656 Byte Ordering" name="ISC_CBC_CFG__CCIRMODE">
        <value caption="Byte ordering Cb0, Y0, Cr0, Y1" name="CBY" value="0x0"/>
        <value caption="Byte ordering Cr0, Y0, Cb0, Y1" name="CRY" value="0x1"/>
        <value caption="Byte ordering Y0, Cb0, Y1, Cr0" name="YCB" value="0x2"/>
        <value caption="Byte ordering Y0, Cr0, Y1, Cb0" name="YCR" value="0x3"/>
      </value-group>
      <value-group caption="CCIR656 Byte Ordering" name="ISC_SUB422_CFG__CCIRMODE">
        <value caption="Byte ordering Cb0, Y0, Cr0, Y1" name="CBY" value="0x0"/>
        <value caption="Byte ordering Cr0, Y0, Cb0, Y1" name="CRY" value="0x1"/>
        <value caption="Byte ordering Y0, Cb0, Y1, Cr0" name="YCB" value="0x2"/>
        <value caption="Byte ordering Y0, Cr0, Y1, Cb0" name="YCR" value="0x3"/>
      </value-group>
      <value-group caption="Low Pass Filter Selection" name="ISC_SUB422_CFG__FILTER">
        <value caption="Cosited, {1}" name="FILT0CO" value="0x0"/>
        <value caption="Centered {1, 1}" name="FILT1CE" value="0x1"/>
        <value caption="Cosited {1,2,1}" name="FILT2CO" value="0x2"/>
        <value caption="Centered {1, 3, 3, 1}" name="FILT3CE" value="0x3"/>
      </value-group>
      <value-group caption="Rounding, Limiting and Packing Mode" name="ISC_RLP_CFG__MODE">
        <value caption="8-bit data" name="DAT8" value="0x0"/>
        <value caption="9-bit data" name="DAT9" value="0x1"/>
        <value caption="10-bit data" name="DAT10" value="0x2"/>
        <value caption="11-bit data" name="DAT11" value="0x3"/>
        <value caption="12-bit data" name="DAT12" value="0x4"/>
        <value caption="8-bit luminance only" name="DATY8" value="0x5"/>
        <value caption="10-bit luminance only" name="DATY10" value="0x6"/>
        <value caption="12-bit RGB+4-bit Alpha (MSB)" name="ARGB444" value="0x7"/>
        <value caption="15-bit RGB+1-bit Alpha (MSB)" name="ARGB555" value="0x8"/>
        <value caption="16-bit RGB" name="RGB565" value="0x9"/>
        <value caption="24-bits RGB mode+8-bit Alpha" name="ARGB32" value="0xA"/>
        <value caption="YCbCr mode (full range, [0-255])" name="YYCC" value="0xB"/>
        <value caption="YCbCr mode (limited range)" name="YYCC_LIMITED" value="0xC"/>
      </value-group>
      <value-group caption="Histogram Operating Mode" name="ISC_HIS_CFG__MODE">
        <value caption="Gr sampling" name="Gr" value="0x0"/>
        <value caption="R sampling" name="R" value="0x1"/>
        <value caption="Gb sampling" name="Gb" value="0x2"/>
        <value caption="B sampling" name="B" value="0x3"/>
        <value caption="Luminance-only mode" name="Y" value="0x4"/>
        <value caption="Raw sampling" name="RAW" value="0x5"/>
        <value caption="Luminance only with CCIR656 10-bit or 8-bit mode" name="YCCIR656" value="0x6"/>
      </value-group>
      <value-group caption="Bayer Color Component Selection" name="ISC_HIS_CFG__BAYSEL">
        <value caption="Starting row configuration is G R G R (red row)" name="GRGR" value="0x0"/>
        <value caption="Starting row configuration is R G R G (red row)" name="RGRG" value="0x1"/>
        <value caption="Starting row configuration is G B G B (blue row" name="GBGB" value="0x2"/>
        <value caption="Starting row configuration is B G B G (blue row)" name="BGBG" value="0x3"/>
      </value-group>
      <value-group caption="DMA Input Mode Selection" name="ISC_DCFG__IMODE">
        <value caption="8 bits, single channel packed" name="PACKED8" value="0x0"/>
        <value caption="16 bits, single channel packed" name="PACKED16" value="0x1"/>
        <value caption="32 bits, single channel packed" name="PACKED32" value="0x2"/>
        <value caption="32 bits, dual channel" name="YC422SP" value="0x3"/>
        <value caption="32 bits, triple channel" name="YC422P" value="0x4"/>
        <value caption="32 bits, dual channel" name="YC420SP" value="0x5"/>
        <value caption="32 bits, triple channel" name="YC420P" value="0x6"/>
      </value-group>
      <value-group caption="DMA Memory Burst Size Y channel" name="ISC_DCFG__YMBSIZE">
        <value caption="DMA single access" name="SINGLE" value="0x0"/>
        <value caption="4-beat burst access" name="BEATS4" value="0x1"/>
        <value caption="8-beat burst access" name="BEATS8" value="0x2"/>
        <value caption="16-beat burst access" name="BEATS16" value="0x3"/>
      </value-group>
      <value-group caption="DMA Memory Burst Size C channel" name="ISC_DCFG__CMBSIZE">
        <value caption="DMA single access" name="SINGLE" value="0x0"/>
        <value caption="4-beat burst access" name="BEATS4" value="0x1"/>
        <value caption="8-beat burst access" name="BEATS8" value="0x2"/>
        <value caption="16-beat burst access" name="BEATS16" value="0x3"/>
      </value-group>
      <value-group caption="Descriptor View" name="ISC_DCTRL__DVIEW">
        <value caption="Address {0} Stride {0} are updated" name="PACKED" value="0x0"/>
        <value caption="Address {0,1} Stride {0,1} are updated" name="SEMIPLANAR" value="0x1"/>
        <value caption="Address {0,1,2} Stride {0,1,2} are updated" name="PLANAR" value="0x2"/>
      </value-group>
    </module>
