Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D29.atdf
        <register caption="High-End Overlay Configuration Register 23" name="LCDC_HEOCFG23" offset="0x000003E8" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 3 tap 0" mask="0x000000FF" name="XPHI3COEFF0"/>
          <bitfield caption="Horizontal Coefficient for phase 3 tap 1" mask="0x0000FF00" name="XPHI3COEFF1"/>
          <bitfield caption="Horizontal Coefficient for phase 3 tap 2" mask="0x00FF0000" name="XPHI3COEFF2"/>
          <bitfield caption="Horizontal Coefficient for phase 3 tap 3" mask="0xFF000000" name="XPHI3COEFF3"/>
        </register>
        <register caption="High-End Overlay Configuration Register 24" name="LCDC_HEOCFG24" offset="0x000003EC" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 3 tap 4" mask="0x000000FF" name="XPHI3COEFF4"/>
        </register>
        <register caption="High-End Overlay Configuration Register 25" name="LCDC_HEOCFG25" offset="0x000003F0" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 4 tap 0" mask="0x000000FF" name="XPHI4COEFF0"/>
          <bitfield caption="Horizontal Coefficient for phase 4 tap 1" mask="0x0000FF00" name="XPHI4COEFF1"/>
          <bitfield caption="Horizontal Coefficient for phase 4 tap 2" mask="0x00FF0000" name="XPHI4COEFF2"/>
          <bitfield caption="Horizontal Coefficient for phase 4 tap 3" mask="0xFF000000" name="XPHI4COEFF3"/>
        </register>
        <register caption="High-End Overlay Configuration Register 26" name="LCDC_HEOCFG26" offset="0x000003F4" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 4 tap 4" mask="0x000000FF" name="XPHI4COEFF4"/>
        </register>
        <register caption="High-End Overlay Configuration Register 27" name="LCDC_HEOCFG27" offset="0x000003F8" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 5 tap 0" mask="0x000000FF" name="XPHI5COEFF0"/>
          <bitfield caption="Horizontal Coefficient for phase 5 tap 1" mask="0x0000FF00" name="XPHI5COEFF1"/>
          <bitfield caption="Horizontal Coefficient for phase 5 tap 2" mask="0x00FF0000" name="XPHI5COEFF2"/>
          <bitfield caption="Horizontal Coefficient for phase 5 tap 3" mask="0xFF000000" name="XPHI5COEFF3"/>
        </register>
        <register caption="High-End Overlay Configuration Register 28" name="LCDC_HEOCFG28" offset="0x000003FC" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 5 tap 4" mask="0x000000FF" name="XPHI5COEFF4"/>
        </register>
        <register caption="High-End Overlay Configuration Register 29" name="LCDC_HEOCFG29" offset="0x00000400" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 6 tap 0" mask="0x000000FF" name="XPHI6COEFF0"/>
          <bitfield caption="Horizontal Coefficient for phase 6 tap 1" mask="0x0000FF00" name="XPHI6COEFF1"/>
          <bitfield caption="Horizontal Coefficient for phase 6 tap 2" mask="0x00FF0000" name="XPHI6COEFF2"/>
          <bitfield caption="Horizontal Coefficient for phase 6 tap 3" mask="0xFF000000" name="XPHI6COEFF3"/>
        </register>
        <register caption="High-End Overlay Configuration Register 30" name="LCDC_HEOCFG30" offset="0x00000404" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 6 tap 4" mask="0x000000FF" name="XPHI6COEFF4"/>
        </register>
        <register caption="High-End Overlay Configuration Register 31" name="LCDC_HEOCFG31" offset="0x00000408" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 7 tap 0" mask="0x000000FF" name="XPHI7COEFF0"/>
          <bitfield caption="Horizontal Coefficient for phase 7 tap 1" mask="0x0000FF00" name="XPHI7COEFF1"/>
          <bitfield caption="Horizontal Coefficient for phase 7 tap 2" mask="0x00FF0000" name="XPHI7COEFF2"/>
          <bitfield caption="Horizontal Coefficient for phase 7 tap 3" mask="0xFF000000" name="XPHI7COEFF3"/>
        </register>
        <register caption="High-End Overlay Configuration Register 32" name="LCDC_HEOCFG32" offset="0x0000040C" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 7 tap 4" mask="0x000000FF" name="XPHI7COEFF4"/>
        </register>
        <register caption="High-End Overlay Configuration Register 33" name="LCDC_HEOCFG33" offset="0x00000410" rw="RW" size="4">
          <bitfield caption="Vertical Coefficient for phase 0 tap 0" mask="0x000000FF" name="YPHI0COEFF0"/>
          <bitfield caption="Vertical Coefficient for phase 0 tap 1" mask="0x0000FF00" name="YPHI0COEFF1"/>
          <bitfield caption="Vertical Coefficient for phase 0 tap 2" mask="0x00FF0000" name="YPHI0COEFF2"/>
        </register>
        <register caption="High-End Overlay Configuration Register 34" name="LCDC_HEOCFG34" offset="0x00000414" rw="RW" size="4">
          <bitfield caption="Vertical Coefficient for phase 1 tap 0" mask="0x000000FF" name="YPHI1COEFF0"/>
          <bitfield caption="Vertical Coefficient for phase 1 tap 1" mask="0x0000FF00" name="YPHI1COEFF1"/>
          <bitfield caption="Vertical Coefficient for phase 1 tap 2" mask="0x00FF0000" name="YPHI1COEFF2"/>
        </register>
        <register caption="High-End Overlay Configuration Register 35" name="LCDC_HEOCFG35" offset="0x00000418" rw="RW" size="4">
          <bitfield caption="Vertical Coefficient for phase 2 tap 0" mask="0x000000FF" name="YPHI2COEFF0"/>
          <bitfield caption="Vertical Coefficient for phase 2 tap 1" mask="0x0000FF00" name="YPHI2COEFF1"/>
          <bitfield caption="Vertical Coefficient for phase 2 tap 2" mask="0x00FF0000" name="YPHI2COEFF2"/>
        </register>
        <register caption="High-End Overlay Configuration Register 36" name="LCDC_HEOCFG36" offset="0x0000041C" rw="RW" size="4">
          <bitfield caption="Vertical Coefficient for phase 3 tap 0" mask="0x000000FF" name="YPHI3COEFF0"/>
          <bitfield caption="Vertical Coefficient for phase 3 tap 1" mask="0x0000FF00" name="YPHI3COEFF1"/>
          <bitfield caption="Vertical Coefficient for phase 3 tap 2" mask="0x00FF0000" name="YPHI3COEFF2"/>
        </register>
