Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D29.atdf
        <register caption="High-End Overlay Configuration Register 37" name="LCDC_HEOCFG37" offset="0x00000420" rw="RW" size="4">
          <bitfield caption="Vertical Coefficient for phase 4 tap 0" mask="0x000000FF" name="YPHI4COEFF0"/>
          <bitfield caption="Vertical Coefficient for phase 4 tap 1" mask="0x0000FF00" name="YPHI4COEFF1"/>
          <bitfield caption="Vertical Coefficient for phase 4 tap 2" mask="0x00FF0000" name="YPHI4COEFF2"/>
        </register>
        <register caption="High-End Overlay Configuration Register 38" name="LCDC_HEOCFG38" offset="0x00000424" rw="RW" size="4">
          <bitfield caption="Vertical Coefficient for phase 5 tap 0" mask="0x000000FF" name="YPHI5COEFF0"/>
          <bitfield caption="Vertical Coefficient for phase 5 tap 1" mask="0x0000FF00" name="YPHI5COEFF1"/>
          <bitfield caption="Vertical Coefficient for phase 5 tap 2" mask="0x00FF0000" name="YPHI5COEFF2"/>
        </register>
        <register caption="High-End Overlay Configuration Register 39" name="LCDC_HEOCFG39" offset="0x00000428" rw="RW" size="4">
          <bitfield caption="Vertical Coefficient for phase 6 tap 0" mask="0x000000FF" name="YPHI6COEFF0"/>
          <bitfield caption="Vertical Coefficient for phase 6 tap 1" mask="0x0000FF00" name="YPHI6COEFF1"/>
          <bitfield caption="Vertical Coefficient for phase 6 tap 2" mask="0x00FF0000" name="YPHI6COEFF2"/>
        </register>
        <register caption="High-End Overlay Configuration Register 40" name="LCDC_HEOCFG40" offset="0x0000042C" rw="RW" size="4">
          <bitfield caption="Vertical Coefficient for phase 7 tap 0" mask="0x000000FF" name="YPHI7COEFF0"/>
          <bitfield caption="Vertical Coefficient for phase 7 tap 1" mask="0x0000FF00" name="YPHI7COEFF1"/>
          <bitfield caption="Vertical Coefficient for phase 7 tap 2" mask="0x00FF0000" name="YPHI7COEFF2"/>
        </register>
        <register caption="High-End Overlay Configuration Register 41" name="LCDC_HEOCFG41" offset="0x00000430" rw="RW" size="4">
          <bitfield caption="Horizontal Filter Phase Offset" mask="0x00000007" name="XPHIDEF"/>
          <bitfield caption="Vertical Filter Phase Offset" mask="0x00070000" name="YPHIDEF"/>
        </register>
        <register caption="Post Processing Channel Enable Register" name="LCDC_PPCHER" offset="0x00000540" rw="W" size="4">
          <bitfield caption="Channel Enable" mask="0x00000001" name="CHEN"/>
          <bitfield caption="Update Overlay Attributes Enable" mask="0x00000002" name="UPDATEEN"/>
          <bitfield caption="Add To Queue Enable" mask="0x00000004" name="A2QEN"/>
        </register>
        <register caption="Post Processing Channel Disable Register" name="LCDC_PPCHDR" offset="0x00000544" rw="W" size="4">
          <bitfield caption="Channel Disable" mask="0x00000001" name="CHDIS"/>
          <bitfield caption="Channel Reset" mask="0x00000100" name="CHRST"/>
        </register>
        <register caption="Post Processing Channel Status Register" name="LCDC_PPCHSR" offset="0x00000548" rw="R" size="4">
          <bitfield caption="Channel Status" mask="0x00000001" name="CHSR"/>
          <bitfield caption="Update Overlay Attributes In Progress Status" mask="0x00000002" name="UPDATESR"/>
          <bitfield caption="Add To Queue Status" mask="0x00000004" name="A2QSR"/>
        </register>
        <register caption="Post Processing Interrupt Enable Register" name="LCDC_PPIER" offset="0x0000054C" rw="W" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Enable" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Enable" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Enable" mask="0x00000020" name="DONE"/>
        </register>
        <register caption="Post Processing Interrupt Disable Register" name="LCDC_PPIDR" offset="0x00000550" rw="W" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Disable" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Disable" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Disable" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Disable" mask="0x00000020" name="DONE"/>
        </register>
        <register caption="Post Processing Interrupt Mask Register" name="LCDC_PPIMR" offset="0x00000554" rw="R" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Mask" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Mask" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Mask" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Mask" mask="0x00000020" name="DONE"/>
        </register>
        <register caption="Post Processing Interrupt Status Register" name="LCDC_PPISR" offset="0x00000558" rw="R" size="4">
          <bitfield caption="End of DMA Transfer" mask="0x00000004" name="DMA"/>
          <bitfield caption="DMA Descriptor Loaded" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Detected" mask="0x00000020" name="DONE"/>
        </register>
        <register caption="Post Processing Head Register" name="LCDC_PPHEAD" offset="0x0000055C" rw="RW" size="4">
          <bitfield caption="DMA Head Pointer" mask="0xFFFFFFFC" name="HEAD"/>
        </register>
        <register caption="Post Processing Address Register" name="LCDC_PPADDR" offset="0x00000560" rw="RW" size="4">
          <bitfield caption="DMA Transfer Start Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Post Processing Control Register" name="LCDC_PPCTRL" offset="0x00000564" rw="RW" size="4">
          <bitfield caption="Transfer Descriptor Fetch Enable" mask="0x00000001" name="DFETCH"/>
          <bitfield caption="End of DMA Transfer Interrupt Enable" mask="0x00000004" name="DMAIEN"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000008" name="DSCRIEN"/>
          <bitfield caption="Add Head Descriptor to Queue Interrupt Enable" mask="0x00000010" name="ADDIEN"/>
          <bitfield caption="End of List Interrupt Enable" mask="0x00000020" name="DONEIEN"/>
        </register>
