Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D29.atdf
        <register caption="Secure PIO Slow Clock Divider Debouncing Register" name="S_PIO_SCDR" offset="0x1500" rw="RW" size="4">
          <bitfield caption="Slow Clock Divider Selection for Debouncing" mask="0x00003FFF" name="DIV"/>
        </register>
        <register caption="Secure PIO Write Protection Mode Register" name="S_PIO_WPMR" offset="0x15E0" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="S_PIO_WPMR__WPKEY"/>
        </register>
        <register caption="Secure PIO Write Protection Status Register" name="S_PIO_WPSR" offset="0x15E4" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="PIO Line Mask" name="PIO_MSKR__MSK">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="I/O Line Function" name="PIO_CFGR__FUNC">
        <value caption="Select the PIO mode for the selected I/O lines." name="GPIO" value="0x0"/>
        <value caption="Select the peripheral A for the selected I/O lines." name="PERIPH_A" value="0x1"/>
        <value caption="Select the peripheral B for the selected I/O lines." name="PERIPH_B" value="0x2"/>
        <value caption="Select the peripheral C for the selected I/O lines." name="PERIPH_C" value="0x3"/>
        <value caption="Select the peripheral D for the selected I/O lines." name="PERIPH_D" value="0x4"/>
        <value caption="Select the peripheral E for the selected I/O lines." name="PERIPH_E" value="0x5"/>
        <value caption="Select the peripheral F for the selected I/O lines." name="PERIPH_F" value="0x6"/>
        <value caption="Select the peripheral G for the selected I/O lines." name="PERIPH_G" value="0x7"/>
      </value-group>
      <value-group caption="Direction" name="PIO_CFGR__DIR">
        <value caption="The selected I/O lines are pure inputs." name="INPUT" value="0"/>
        <value caption="The selected I/O lines are enabled in output." name="OUTPUT" value="1"/>
      </value-group>
      <value-group caption="Pull-Up Enable" name="PIO_CFGR__PUEN">
        <value caption="Pull-Up is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="Pull-Up is enabled for the selected I/O lines." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Pull-Down Enable" name="PIO_CFGR__PDEN">
        <value caption="Pull-Down is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="Pull-Down is enabled for the selected I/O lines only if PUEN is 0." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Input Filter Enable" name="PIO_CFGR__IFEN">
        <value caption="The input filter is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="The input filter is enabled for the selected I/O lines." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Input Filter Slow Clock Enable" name="PIO_CFGR__IFSCEN">
        <value caption="The glitch filter is able to filter glitches with a duration &lt; tmck/2 for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="The debouncing filter is able to filter pulses with a duration &lt; tdiv_slck/2 for the selected I/O lines." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Open-Drain" name="PIO_CFGR__OPD">
        <value caption="The open-drain is disabled for the selected I/O lines. I/O lines are driven at high- and low-level." name="DISABLED" value="0"/>
        <value caption="The open-drain is enabled for the selected I/O lines. I/O lines are driven at low-level only." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Schmitt Trigger" name="PIO_CFGR__SCHMITT">
        <value caption="Schmitt trigger is enabled for the selected I/O lines." name="ENABLED" value="0"/>
        <value caption="Schmitt trigger is disabled for the selected I/O lines." name="DISABLED" value="1"/>
      </value-group>
      <value-group caption="Drive Strength" name="PIO_CFGR__DRVSTR">
        <value caption="Low drive" name="LO" value="0x0"/>
        <value caption="Low drive" name="LO2" value="0x1"/>
        <value caption="Medium drive" name="ME" value="0x2"/>
        <value caption="High drive" name="HI" value="0x3"/>
      </value-group>
      <value-group caption="Event Selection" name="PIO_CFGR__EVTSEL">
        <value caption="Event detection on input falling edge" name="FALLING" value="0x0"/>
        <value caption="Event detection on input rising edge" name="RISING" value="0x1"/>
        <value caption="Event detection on input both edge" name="BOTH" value="0x2"/>
        <value caption="Event detection on low level input" name="LOW" value="0x3"/>
        <value caption="Event detection on high level input" name="HIGH" value="0x4"/>
      </value-group>
      <value-group caption="Physical Configuration Freeze Status (read-only)" name="PIO_CFGR__PCFS">
        <value caption="The fields are not frozen and can be written for this I/O line." name="NOT_FROZEN" value="0"/>
        <value caption="The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields." name="FROZEN" value="1"/>
      </value-group>
      <value-group caption="Interrupt Configuration Freeze Status (read-only)" name="PIO_CFGR__ICFS">
        <value caption="The fields are not frozen and can be written for this I/O line." name="NOT_FROZEN" value="0"/>
        <value caption="The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields." name="FROZEN" value="1"/>
      </value-group>
      <value-group caption="Freeze Key" name="PIO_IOFR__FRZKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit." name="PASSWD" value="0x494F46"/>
      </value-group>
      <value-group caption="PIO Line 0 Mask" name="S_PIO_MSKR__MSK">
        <value caption="Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="I/O Line Function" name="S_PIO_CFGR__FUNC">
        <value caption="Select the PIO mode for the selected I/O lines." name="GPIO" value="0x0"/>
        <value caption="Select the peripheral A for the selected I/O lines." name="PERIPH_A" value="0x1"/>
        <value caption="Select the peripheral B for the selected I/O lines." name="PERIPH_B" value="0x2"/>
        <value caption="Select the peripheral C for the selected I/O lines." name="PERIPH_C" value="0x3"/>
        <value caption="Select the peripheral D for the selected I/O lines." name="PERIPH_D" value="0x4"/>
        <value caption="Select the peripheral E for the selected I/O lines." name="PERIPH_E" value="0x5"/>
        <value caption="Select the peripheral F for the selected I/O lines." name="PERIPH_F" value="0x6"/>
        <value caption="Select the peripheral G for the selected I/O lines." name="PERIPH_G" value="0x7"/>
      </value-group>
      <value-group caption="Direction" name="S_PIO_CFGR__DIR">
        <value caption="The selected I/O lines are pure inputs." name="INPUT" value="0"/>
        <value caption="The selected I/O lines are enabled in output." name="OUTPUT" value="1"/>
      </value-group>
      <value-group caption="Pull-Up Enable" name="S_PIO_CFGR__PUEN">
        <value caption="Pull-Up is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="Pull-Up is enabled for the selected I/O lines." name="ENABLED" value="1"/>
      </value-group>
