Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D29.atdf
        <register caption="Wakeup Control Register" name="SDMMC_WCR" offset="0x2B" rw="RW" size="1">
          <bitfield caption="Wakeup Event Enable on Card Interrupt" mask="0x00000001" name="WKENCINT" values="SDMMC_WCR__WKENCINT"/>
          <bitfield caption="Wakeup Event Enable on Card Insertion" mask="0x00000002" name="WKENCINS" values="SDMMC_WCR__WKENCINS"/>
          <bitfield caption="Wakeup Event Enable on Card Removal" mask="0x00000004" name="WKENCREM" values="SDMMC_WCR__WKENCREM"/>
        </register>
        <register caption="Clock Control Register" name="SDMMC_CCR" offset="0x2C" rw="RW" size="2">
          <bitfield caption="Internal Clock Enable" mask="0x00000001" name="INTCLKEN"/>
          <bitfield caption="Internal Clock Stable" mask="0x00000002" name="INTCLKS"/>
          <bitfield caption="SD Clock Enable" mask="0x00000004" name="SDCLKEN"/>
          <bitfield caption="Clock Generator Select" mask="0x00000020" name="CLKGSEL"/>
          <bitfield caption="Upper Bits of SDCLK Frequency Select" mask="0x000000C0" name="USDCLKFSEL"/>
          <bitfield caption="SDCLK Frequency Select" mask="0x0000FF00" name="SDCLKFSEL"/>
        </register>
        <register caption="Timeout Control Register" name="SDMMC_TCR" offset="0x2E" rw="RW" size="1">
          <bitfield caption="Data Timeout Counter Value" mask="0x0000000F" name="DTCVAL"/>
        </register>
        <register caption="Software Reset Register" name="SDMMC_SRR" offset="0x2F" rw="RW" size="1">
          <bitfield caption="Software reset for All" mask="0x00000001" name="SWRSTALL"/>
          <bitfield caption="Software reset for CMD line" mask="0x00000002" name="SWRSTCMD"/>
          <bitfield caption="Software reset for DAT line" mask="0x00000004" name="SWRSTDAT"/>
        </register>
        <register caption="Normal Interrupt Status Register" name="SDMMC_NISTR" offset="0x30" rw="RW" size="2">
          <mode name="SD_SDIO"/>
          <mode name="E_MMC"/>
          <bitfield caption="Command Complete" mask="0x00000001" modes="SD_SDIO" name="CMDC"/>
          <bitfield caption="Transfer Complete" mask="0x00000002" modes="SD_SDIO" name="TRFC"/>
          <bitfield caption="Block Gap Event" mask="0x00000004" modes="SD_SDIO" name="BLKGE"/>
          <bitfield caption="DMA Interrupt" mask="0x00000008" modes="SD_SDIO" name="DMAINT"/>
          <bitfield caption="Buffer Write Ready" mask="0x00000010" modes="SD_SDIO" name="BWRRDY"/>
          <bitfield caption="Buffer Read Ready" mask="0x00000020" modes="SD_SDIO" name="BRDRDY"/>
          <bitfield caption="Card Insertion" mask="0x00000040" modes="SD_SDIO" name="CINS"/>
          <bitfield caption="Card Removal" mask="0x00000080" modes="SD_SDIO" name="CREM"/>
          <bitfield caption="Card Interrupt" mask="0x00000100" modes="SD_SDIO" name="CINT"/>
          <bitfield caption="Error Interrupt" mask="0x00008000" modes="SD_SDIO" name="ERRINT"/>
          <bitfield caption="Command Complete" mask="0x00000001" modes="E_MMC" name="CMDC"/>
          <bitfield caption="Transfer Complete" mask="0x00000002" modes="E_MMC" name="TRFC"/>
          <bitfield caption="Block Gap Event" mask="0x00000004" modes="E_MMC" name="BLKGE"/>
          <bitfield caption="DMA Interrupt" mask="0x00000008" modes="E_MMC" name="DMAINT"/>
          <bitfield caption="Buffer Write Ready" mask="0x00000010" modes="E_MMC" name="BWRRDY"/>
          <bitfield caption="Buffer Read Ready" mask="0x00000020" modes="E_MMC" name="BRDRDY"/>
          <bitfield caption="Boot Acknowledge Received" mask="0x00004000" modes="E_MMC" name="BOOTAR"/>
          <bitfield caption="Error Interrupt" mask="0x00008000" modes="E_MMC" name="ERRINT"/>
        </register>
        <register caption="Error Interrupt Status Register" name="SDMMC_EISTR" offset="0x32" rw="RW" size="2">
          <mode name="SD_SDIO"/>
          <mode name="E_MMC"/>
          <bitfield caption="Command Timeout Error" mask="0x00000001" modes="SD_SDIO" name="CMDTEO"/>
          <bitfield caption="Command CRC Error" mask="0x00000002" modes="SD_SDIO" name="CMDCRC"/>
          <bitfield caption="Command End Bit Error" mask="0x00000004" modes="SD_SDIO" name="CMDEND"/>
          <bitfield caption="Command Index Error" mask="0x00000008" modes="SD_SDIO" name="CMDIDX"/>
          <bitfield caption="Data Timeout Error" mask="0x00000010" modes="SD_SDIO" name="DATTEO"/>
          <bitfield caption="Data CRC error" mask="0x00000020" modes="SD_SDIO" name="DATCRC"/>
          <bitfield caption="Data End Bit Error" mask="0x00000040" modes="SD_SDIO" name="DATEND"/>
          <bitfield caption="Current Limit Error" mask="0x00000080" modes="SD_SDIO" name="CURLIM"/>
          <bitfield caption="Auto CMD Error" mask="0x00000100" modes="SD_SDIO" name="ACMD"/>
          <bitfield caption="ADMA Error" mask="0x00000200" modes="SD_SDIO" name="ADMA"/>
          <bitfield caption="Command Timeout Error" mask="0x00000001" modes="E_MMC" name="CMDTEO"/>
          <bitfield caption="Command CRC Error" mask="0x00000002" modes="E_MMC" name="CMDCRC"/>
          <bitfield caption="Command End Bit Error" mask="0x00000004" modes="E_MMC" name="CMDEND"/>
          <bitfield caption="Command Index Error" mask="0x00000008" modes="E_MMC" name="CMDIDX"/>
          <bitfield caption="Data Timeout error" mask="0x00000010" modes="E_MMC" name="DATTEO"/>
          <bitfield caption="Data CRC Error" mask="0x00000020" modes="E_MMC" name="DATCRC"/>
          <bitfield caption="Data End Bit Error" mask="0x00000040" modes="E_MMC" name="DATEND"/>
          <bitfield caption="Current Limit Error" mask="0x00000080" modes="E_MMC" name="CURLIM"/>
          <bitfield caption="Auto CMD Error" mask="0x00000100" modes="E_MMC" name="ACMD"/>
          <bitfield caption="ADMA Error" mask="0x00000200" modes="E_MMC" name="ADMA"/>
          <bitfield caption="Boot Acknowledge Error" mask="0x00001000" modes="E_MMC" name="BOOTAE"/>
        </register>
        <register caption="Normal Interrupt Status Enable Register" name="SDMMC_NISTER" offset="0x34" rw="RW" size="2">
          <mode name="SD_SDIO"/>
          <mode name="E_MMC"/>
          <bitfield caption="Command Complete Status Enable" mask="0x00000001" modes="SD_SDIO" name="CMDC" values="SDMMC_NISTER__CMDC"/>
          <bitfield caption="Transfer Complete Status Enable" mask="0x00000002" modes="SD_SDIO" name="TRFC" values="SDMMC_NISTER__TRFC"/>
          <bitfield caption="Block Gap Event Status Enable" mask="0x00000004" modes="SD_SDIO" name="BLKGE" values="SDMMC_NISTER__BLKGE"/>
          <bitfield caption="DMA Interrupt Status Enable" mask="0x00000008" modes="SD_SDIO" name="DMAINT" values="SDMMC_NISTER__DMAINT"/>
          <bitfield caption="Buffer Write Ready Status Enable" mask="0x00000010" modes="SD_SDIO" name="BWRRDY" values="SDMMC_NISTER__BWRRDY"/>
          <bitfield caption="Buffer Read Ready Status Enable" mask="0x00000020" modes="SD_SDIO" name="BRDRDY" values="SDMMC_NISTER__BRDRDY"/>
          <bitfield caption="Card Insertion Status Enable" mask="0x00000040" modes="SD_SDIO" name="CINS" values="SDMMC_NISTER__CINS"/>
          <bitfield caption="Card Removal Status Enable" mask="0x00000080" modes="SD_SDIO" name="CREM" values="SDMMC_NISTER__CREM"/>
          <bitfield caption="Card Interrupt Status Enable" mask="0x00000100" modes="SD_SDIO" name="CINT" values="SDMMC_NISTER__CINT"/>
          <bitfield caption="Command Complete Status Enable" mask="0x00000001" modes="E_MMC" name="CMDC" values="SDMMC_NISTER_E_MMC__CMDC"/>
          <bitfield caption="Transfer Complete Status Enable" mask="0x00000002" modes="E_MMC" name="TRFC" values="SDMMC_NISTER_E_MMC__TRFC"/>
          <bitfield caption="Block Gap Event Status Enable" mask="0x00000004" modes="E_MMC" name="BLKGE" values="SDMMC_NISTER_E_MMC__BLKGE"/>
          <bitfield caption="DMA Interrupt Status Enable" mask="0x00000008" modes="E_MMC" name="DMAINT" values="SDMMC_NISTER_E_MMC__DMAINT"/>
          <bitfield caption="Buffer Write Ready Status Enable" mask="0x00000010" modes="E_MMC" name="BWRRDY" values="SDMMC_NISTER_E_MMC__BWRRDY"/>
          <bitfield caption="Buffer Read Ready Status Enable" mask="0x00000020" modes="E_MMC" name="BRDRDY" values="SDMMC_NISTER_E_MMC__BRDRDY"/>
          <bitfield caption="Boot Acknowledge Received Status Enable" mask="0x00004000" modes="E_MMC" name="BOOTAR" values="SDMMC_NISTER_E_MMC__BOOTAR"/>
        </register>
